{
  "jobs": [
    {
      "title": "JavaScript Developer",
      "company": "Tradeweb Markets LLC",
      "location": "London",
      "salary": "",
      "summary": "You will be developing the UI for the next generation of Tradeweb’s trading platform, which is based on modern web technologies like HTML5 and Chromium....",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0CMUDaL693WNRk3nrnFOjU9lIdT9MBrzyndVEc7SiTvGdIj738vZRBDun4MgP549o6wzm4XqiRAHatmCm2hJbhhNGnjQ_YK51Iv0hAZ8PZrgAZJUHmJqyMpfNxrQgssSCP0PNl393ZJbpwh5tv0_IYYYlPKSPPa3Z7a3zFyCvOVtvzhQFfmRPbx6KZmbE6h1KgZfezLfMQXkfyay7uWSP9ncnlCwCOvlSTTuFqkyzmeAwJAOX2TJRtBh4HCWlLcwNVYgBV40rMaSV-cZ7ujNmy3D7ha2p3QAdmk2ZGQX4EVMGagupE726vjuPwoDnkftjeXiqKzeMljxblRPZg4k1ko4HhA0nO2ph7GRJpRWeuD0s_6dvayF8IpkJGVJ5D-pyEQ8jB-ravGagpBM0sW996Wkji_XdClJe4OUPALfxJRHw==&vjs=3&p=1&sk=&fvj=0",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div>\n<div>You will be developing the UI for the next generation of Tradeweb’s trading platform, which is based on modern web technologies like HTML5 and Chromium. Passionate about software engineering, UX, single-page web applications, and the world of JavaScript, you will need to apply your existing expertise and develop it further to drive Tradeweb’s technology forward.</div>\n<br>\n<div>You will be responsible for delivering software end-to-end, from liaising with product managers and designers, to coordinating across international development teams on engineering and architecture, to working with our QA and dev ops teams - all ultimately to deliver a quality, innovative product to the traders and investors who depend on our platform every day.</div>\n</div>\n<br>\n<div>\n<b>Qualifications/Experience:</b><br>\n<ul><li>Education: at least Bachelor's Degree, preferably in Computer Science</li></ul>\n<ul><li>At least 3 years’ professional web application development experience</li></ul>\n<ul><li>Expert-level JavaScript ES5 / ES6 / ES7 knowledge, and curiosity to learn more</li></ul>\n<ul><li>Experience with or interest in using TypeScript</li></ul>\n<ul><li>Experience with AngularJS and Angular 2/4/5/6 – the more in-depth your understanding, the better</li></ul>\n• HTML5, CSS3, SASS\n<ul><li>Superior analytical and problem solving ability</li></ul>\n<ul><li>Broad knowledge of web platform and technologies\n</li></ul>\n<ul><li>Robust understanding of performance issues, computational complexity, and code optimization.</li></ul>\n<ul><li>Ability to apply expert knowledge of web platform and technologies to achieve business goals and solve new problems in a creative way.</li></ul>\n<ul><li>Familiarity and implementation of industry-standard algorithms and design patterns</li></ul>\n<ul><li>Proactive and team player who can deliver in a high pressure demanding environment</li></ul>\n<ul><li>Interest in UX and UI design implementation</li></ul>\n<br>\n<br>\n<br>\n<b>About the Company:\n</b><div>Tradeweb Markets builds and operates many of the world’s most efficient financial marketplaces, providing market participants with greater transparency and efficiency in fixed income and derivatives. Focused on applying technology to enhance efficiency throughout the trade lifecycle, Tradeweb pioneered straight-through-processing in fixed income and now supports marketplaces for over 20 asset classes with electronic execution, processing, post-trade analysis and market data in an integrated workflow. Customers rely on Tradeweb to drive the evolution of fixed income and derivatives through flexible trading architecture and more efficient, transparent markets.</div>\n<br>\n<br>\nTradeweb values diversity of culture and thought and seeks talented, qualified employees in all its operations around the world regardless of race, gender, national origin, religion, sexual orientation, disability, age or any other protected classification under country or local law.</div>\n</div>\n"
    },
    {
      "title": "Oracle Apex Developer",
      "company": "Sky",
      "location": "London SW1A",
      "salary": "",
      "summary": "We're Sky, Europe's biggest entertainment brand. Think top-quality shows. Breaking news. Innovative tech. Must-have products. Careers here mean the freedom...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0C36Gf_gA6mIvXbLC_CGcBAee6d1qYBWNX2M8K5a2PWOT2oTUUCT48MXomPbSKuGS0pv5Qo6oOGrpw8U_sczVsJ70I8ERSqc3ev686MXVTsnkFVpSmtvlablbuLaS--qdChaVlaLi7-nG8LZpsAPtSx4fkuoaSbx8y3LsACFMBmXQADa51_R79bfC6Dxsaw-x4BRkQAD4Wc1Ptx4CdwSXXlCE-5WOOpAdVVPwK4Hg4bbiecXY-WaOUJlhlrx5AAFayMn-By3g56jb5qBEoxwC9dKpAUUTbzMbn33RedL6UoPY-gRHQbcg5_xjr38MPgJute-ueDCflV1Dzi2sJcUaGldTtjTDP-GHNngtYhDYMhzIz-xfBaflQU6aRjvS_y623n9H_km9fqOK0gCmh-4EEf3QuL7MkHvXye5_XJ2bhnJukzS-IQOlvdA_yAH1ECLuFb8VP78UO8DYC_7ZeigR7sXvPqkPmQgzCCbB0iIv7oVDHllART7jmV&vjs=3&p=2&sk=&fvj=0",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item  icl-u-xs-mt--xs\">Permanent</div></div>\n<div>\n<p>We're Sky, Europe's biggest entertainment brand. Think top-quality shows. Breaking news. Innovative tech. Must-have products. Careers here mean the freedom and support you need to make an impact - pushing boundaries, creating solutions, hitting targets. And as part of our close-knit team, you'll enjoy plenty of benefits. Plus, experiences you'll only find at Sky.<br>\n</p>\n<br>\n<p>This role is an exciting opportunity to join us and work within our Sky UKIS APEX Development Team<br>\n</p>\n<p><b>\nThe Perks</b><br>\n</p>\n<p><br>\nSky Q, a generous pension and private health care. Plus, access to over 12,000 LinkedIn Learning courses to support your development.<br>\n</p>\n<br>\n<p>To find out more about working with us, search #LifeatSky on LinkedIn, Twitter or Instagram.<br>\n</p>\n<br>\n<p><b>You will:<br>\n</b></p>\n<div>\n<br>\n<ul>\n<li>Learn about different parts of Sky Technology Business and gain an understanding of the Sky Network Services data domain. Apply this knowledge to develop Oracle web based database applications.</li>\n<li>Discuss requirements with business users and design Oracle database applications using relational database design, APEX software and Agile methods.</li>\n<li>Develop in APEX to create new web-forms, incorporating SQL and PL/SQL code. Develop more complex functionality in Oracle PL/SQL. Write pre-defined reports in SQL. Enhance the APEX screens using JavaScript, JQuery and/or CSS.</li>\n<li>Design new Relational Databases, including tables, foreign keys, indexes and triggers. Write SQL scripts to create database objects. Develop SQL Loader scripts to load historical data into Oracle database.</li>\n<li>Support and enhance live APEX applications (currently 5).</li>\n</ul>\n<br>\n<b>\nYou'll have:</b>\n</div>\n<div>\n<br>\n<ul>\n<li>Ability to work in a highly pressurised environment.</li>\n<li>Excellent communication skills.</li>\n<li>Excellent SQL skills.</li>\n<li>Database skills with Oracle or similar (e.g. SQLServer/MySQL)</li>\n<li>Able to co-ordinate development activities with other teams (including external teams) where dependencies exist. Ensure satisfaction levels are maintained in respect of quality and timing of deliverables.</li>\n<li>Ability to communicate in a pragmatic and proactive way with other members of the team.</li>\n<li>Take a logical and organised approach to problem solving identifying the root cause of problems and taking positive action to prevent reoccurrence.</li>\n</ul>\n<br>\n</div>\n<p>\nSo, what are you waiting for? Apply now for a chance to forge your own career path and be brilliant as part of a bright, talented team.<br>\n</p>\n<br>\n<p>Just so you know: if your application is successful, your appointment will be subject to receiving a positive outcome from your criminal record check.<br>\n</p>\n<br>\n<p>We're happy to discuss flexible working.<br>\n</p>\n<br>\n<p><i>It's our people that make Sky Europe's leading entertainment company. That's why we work hard to be an inclusive employer, so everyone at Sky can be their best.</i><br>\n</p>\n<p><i>\nIf you are successful in your application for this role, your appointment will be subject to receiving a positive outcome from your Criminal Record Check.</i><br>\n</p>\n<p><i>\nA job you love to talk about</i></p>\n</div>\n</div>\n"
    },
    {
      "title": "Developer",
      "company": "Virtus Partners",
      "location": "London",
      "salary": "",
      "summary": "Able to assist other Developers as necessary. Developer required for a unique, highly configurable front office application providing credit analysis, order...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0A5xYOhj4pPEDfnbhTjC7M7fQaVOgP8QdhtfGw3GECDggWSVMjWwOQLApSjiCDrZFCsRvygZcyQOEHCJBptCHGvcTJRtuV92AWj3H4DP9xpjdjfZcGQgQPEcaZlQ2xXrXTSWAmGU27ddobXKA9eiglWkFEJnef6pPRy4JugLJdnqaBLsOkIQlAd3zf5-4qLbJQM-8mI0aqdfPYo7Ne0sAek6ismpn1Y0W2MWdJnvwUoCnxgxyNcOmLZbyuMtfRmzg0rMBx2R1BHPe-RCGm-AH23faLIlQ23r1i5ZD6HQ9ME8mXmqXSnt-FNB6yEZzLDhCOhKmUWjHT2tleGKoEJSkNplO7rsx3Pdww6kIMgGoiI77bW2knssUzhJpI_q9glSsFsNCwhTj2Zv03bVvGF0mMl-mnGRIjXkfn_w4iKmIscNqv74QldfxerTfMSXBZJhxp4kSyri8TysCo4bWqMZcPL5ohdQPdDDd3N9_j09zuTVw9I6gEipwnFiFfXj3RG-wP1J82AU27O_3DXket-wFMW2OUA5MnAsMN6hswBxLvH61OA48woKxBVAR-CooDZayGl2ENI8mNiXl91G8oIzNKJY5nkzu9coNHgCpunywCZ_ZjPtLu6aW-HW6Z5pNP79gSfvZtOV6ST4xXF8q8xCy2gjVyHnqO64b8=&vjs=3&p=3&sk=&fvj=0",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div>Developer required for a unique, highly configurable front office application providing credit analysis, order management, portfolio management and compliance modules across desktop, web and mobile platforms. Joining a small team of back and front-end developers to help improve the existing application and take ownership of implementing new features as part of the product roadmap. We are looking for someone who has experience in Finance, enjoys contributing ideas (both technical and product related) and who can mentor more junior developers where required.\n<ul>\n<li>The development team owns the full software life-cycle of the project. The role therefore includes understanding requirements, interacting with clients directly, design/code/test/implement and production support of the platform.</li>\n<li>Self-starter with ability to build working relationships and ability to work effectively in a fast-paced environment.</li>\n<li>Willingness to take full ownership and drive projects and tasks to completion.</li>\n<li>Review, discuss and work within agreed timescales and provide feedback to project managers as necessary.</li>\n<li>Participate in continuous improvement activities by identifying and appropriately escalating process and product quality gaps, providing solutions when possible.</li>\n<li>Other duties as assigned by Management.</li>\n<br>\n</ul>\n<br>\nRequired Skills<br>\n<p><b>Special Skills and/or Abilities:</b></p>\n<ul>\n<li>Experience of Agile development processes including ability to work in Sprint based deliveries</li>\n<li>Ability to build / troubleshoot / maintain an automated Dev Ops pipeline</li>\n<li>Strong problem solving and logic skills.</li>\n<li>Able to assist other Developers as necessary.</li>\n<li>Able to evaluate and propose new technologies where appropriate</li>\n<li>Strong verbal and written communication skills.</li>\n<li>Excellent interpersonal skills and collaborative style.</li>\n<br>\n</ul>\n<br>\nRequired Experience<br>\n<p><b>Education/Training (or equivalent):</b></p>\n<ul>\n<li>Bachelor’s Degree in Computer Science or equivalent preferred, but comparable work experience will be considered.</li>\n<br>\n</ul>\n<br>\n<p><b>Experience (Type of work experience, minimum number of years):</b></p>\n<ul>\n<li>Minimum of 5 years’ software development experience programming with the .NET framework, preferably C#.</li>\n<li>Minimum 5 years’ experience with SQL (preferably PostgeSQL but any RDB will be considered)</li>\n<li>Minimum of 2 years Capital Markets Financial product experience</li>\n<li>Experience of Python a plus</li>\n<li>Experience of F# a plus</li>\n<li>Experience of AWS / Azure a plus</li>\n<li>Collateralized Debt Obligations (CDOs) or fixed income/structured finance instruments, is a plus.</li>\n</ul>\n</div></div>\n"
    },
    {
      "title": "Business Intelligence Developer",
      "company": "Mimecast",
      "location": "London",
      "salary": "",
      "summary": "The Business Intelligence Developer will:. Developer with deep level subject matter expertise across the board, and proven ability to deliver on high priority...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0DfVJ4i74vC6hjtXAveDfy4EYCTTj9PoPbyskc7UEbU0Wh3sLZdg1Rqf3hZLF2RcIRwH7_uC846E_NlE9B7VKwMHQPDs7jvi9Tq3NXCknIed9j1HTYXjJ_OXz8uREQOPCy7AmcaEZAt_pQ424xCLZT6An0gkBV0nPqbffIXyy3wNA35JNbLeKH3V8kWhU4H29hRC8K5j54awoXJEHLOU7hQPAvYtjdbIU56hQuigUaCxBsc0wtD_fZw307KG-uK3sc9GgmMXLKZSLbPt7Qtwn3L7MJX8QncOgDKR0t1mhoUCX71G7HOD7v4t7u2Q72VNrB2s4-hiZm3-xYpKygt-IRWDuCZX13yU_JQhPD3HUG2LBeeRVjgWxgQs67taACJMwhiwisIEac3-Q==&vjs=3&p=4&sk=&fvj=0",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div>\n<b>ID </b>2018-3479<br>\n<b>Job Location(s) </b>UK-London<br>\n<b>Position Type </b>Permanent - Full Time<br>\n<br>\n<b>More information about this job:</b><br>\n<b>Overview</b><br>\n<br>\n<b>About the role</b><br>\n<br>\nWe at Mimecast take the pain out of handling our clients' most important data: the information that passes through their email systems. Our solution is to cut through the complexity of corporate email. We built a platform from scratch that uses cloud computing to deliver email management. Everything we've done since, has been designed to take the pain out of information management and make the next generation of technology work better for our customers.<br>\n<br>\n<br>\n<b>Our People</b><br>\n<br>\nOur people are the very best. They have high levels of self-motivation which results in exceptional performance. We care deeply about our customers and take pride in delivering top class customer service.<br>\n<br>\n<br>\nWe instinctively find practical solutions to complex problems, we take personal responsibility for our actions and embrace teamwork. At Mimecast we strive to win and celebrate our successes.<br>\n<br>\n<br>\n<b>About the position</b><br>\n<br>\nMimecast are seeking an experienced B.I. Developer with deep level subject matter expertise across the board, and proven ability to deliver on high priority work items in a fast paced and changing business environment.<br>\n<br>\n<br>\nOutstanding technical skills should be paired with excellent communications skills as the role involves working closely with business partners in Finance, Operations, Sales and Marketing.<br>\n<br>\n<br>\nYou will be working as part of a dynamic team, delivering best-in-class B.I. capabilities using the Microsoft B.I. stack. Our focus is primarily on delivering and supporting a scalable, performant and robust data warehouse that is utilised by our Analytics teams. As such the main skills focus is SQL Server, SSIS and SSAS.<br>\n<br>\n<b>Responsibilities</b><br>\n<br>\n<b>The Business Intelligence Developer will:</b><br>\n<ul>\n<li>Develop and support Business Intelligence solutions to agreed specifications and timescales.</li>\n<li>\nAutomate processes and develop efficiencies.</li>\n<li>\nCleanse, manipulate/transform and format large datasets to enable data quality improvements.</li>\n<li>\nTroubleshoot production issues and provide solutions in a timely manner.</li>\n<li>\nSupport end to end maintenance requests on existing data sources .</li>\n<li>\nEnsure data availability and uptime of the BI apparatus.</li>\n<li>\nBe available to help in any area of the team where the successful person's skillset fits.</li>\n</ul>\n<br>\n<br>\n<br>\n<b>Qualifications</b><br>\n<br>\n<ul>\n<li>A minimum of 3 years' experience working with the Microsoft BI stack (SQL Server, SSIS and SSAS).</li>\n<li>\nSQL Server 2012 or later.</li>\n<li>\nExperience developing complex SQL queries, MDX, and stored procedures required.</li>\n<li>\nExperience of query performance optimisation.</li>\n<li>\nExperience of building Analysis Services cubes.</li>\n<li>\nUnderstanding of dimensional modelling. Kimball preferred.</li>\n<li>\nStrong problem solving, exceptional numeracy, analytical rigor and attention to detail.</li>\n<li>\nStrong organisational skills.</li>\n<li>\nA willingness to follow the teams' documentation procedures and contribute to creating and maintaining technical and support documents.</li>\n<li>\nThe ability to work in a fast-paced, rapidly evolving company environment.</li>\n</ul>\n<br>\n<b>\nReward</b><br>\n<br>\nWe offer a highly competitive rewards and benefits package including private healthcare, pension, life cover and an annual gym subsidization. Mimecast is an entrepreneurial and high growth company which will provide the right candidate with a wealth of career development opportunities. All Mimecasters strive on being high performers, problem solvers, team players with passion, integrity and effectiveness.<br>\n<br>\n<br>\nMimecast is a global company with certain business operations in North America. By responding to this advertisement you are agreeing to your details, including any personally identifiable information therein, to be transferred to Mimecast North America, Inc. Mimecast North America, Inc will maintain adequate technical and organizational measure to protect your personally identifiable information and shall use it for the purposes of assessing suitability for this role. Should you wish to respond to this advertisement but do not consent to such transfer, please notify us in advance so that we are able to make alternative arrangements.<br>\n<br>\n<br>\n#LI-RT1<p>\nPI106040013</p>\n</div></div>\n"
    },
    {
      "title": "C# Developer",
      "company": "Eurostop Ltd",
      "location": "London",
      "salary": "",
      "summary": "We are looking for a C# developer to join our application development team working across our range of products on all aspects (repository, middleware, front...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0AHMcY31bdtewPnOy2-_ijbWGRCwxFq1vZH53CXKBpC88uB5HhnH7q3BTgmPo96kezE1tGqbhyY6ExOVKkopUSnqirMQmw4uQ8miymVOE0_gOBGBJpEkcCJV2XFwRbmGxWEmLc89nUt2XUwUyGOy9jBJsntmLixRdpqU4QszIn4j99TZE2GptuHa-yncBHGwXwuo6SEBUuEG42esb4WHg2RWV0sgir9eyyFjrAFns16z0mFnwOKqOVfc-IPROCj5whehZDfjy7VQeB8KhkF86dX_GvkffiN5hrid3ZTh47T7OjtkZQ7XWU9pLTZg4IU1Y_EzJonyKM8m8gEuSCXEDUrD32Xgk45BYZnn1iWTQE4CsWg7HNmV6hTHnddCdDoWm9GDHo4eLbVfcaOlAqWLK6ufZF0pD9sxt_xALVY2O346sl_mBi9EoBw&vjs=3&p=5&sk=&fvj=1",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<p><b>Job Summary</b></p>\n<p><b>Who we are</b></p>\n<p>We are a leading software house in the retail sector, providing solutions in Europe, USA and Asia. We commenced in the UK in 1990 specialising in the fashion and footwear market sector and have since expanded into Asia where we have some of the largest retail estates in the world.</p>\n<p><b>The opportunity</b></p>\n<p>We are looking for a C# developer to join our application development team working across our range of products on all aspects (repository, middleware, front-end). The opportunity involves all aspects of the development lifecycle including design, prototyping and research. There are many diverse aspects to be involved in including distributed systems architecture, high performance database design, front-end and mobile apps. The position involves a large amount of innovative, new code.</p>\n<p>We are open to innovation and forward thinking approaches, and we value input into strategic, design and user experience matters from all team members. We favour continuous learning and are supportive of your ongoing training and professional development.</p>\n<p><b>Job Type / Category</b></p>\n<p>This is a full time role.</p>\n<p><b>Required Education, Skills and Qualifications</b></p>\n<p><b>Required skills</b></p>\n<ul>\n<li>C# / .NET</li>\n<li>HTML5</li>\n<li>NET MVC, WebAPI, HTML + CSS, Javascript, JQuery, TypeScript</li>\n<li>Angular</li>\n<li>MS SQL Server</li>\n<li>Good communication skills</li>\n</ul>\n<p><b>Desirable skills</b></p>\n<ul>\n<li>Experience of DDD / IOC</li>\n<li>Experience of .NET multithreaded apps</li>\n<li>Experience of writing efficient code</li>\n<li>Experience of working with Azure</li>\n<li>Experience using .NET core</li>\n<li>Experience with high-volumne production systems</li>\n</ul>\n<p>Job Type: Full-time</p>\n</div>\n"
    },
    {
      "title": "Junior database developer (entry level)",
      "company": "CoderList",
      "location": "London",
      "salary": "£24,000 - £28,000 a year",
      "summary": "You will work closely alongside Data Architect and Senior Database Developers and operations and management team....",
      "link": "https://www.indeed.co.uk/company/CoderList/jobs/Junior-Database-Developer-ac3db2cb4003214d?fccid=80877499a43578a8&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item \">£24,000 - £28,000 a year</div></div>\n<p>This is a great opportunity to work with an exciting Saas start up in London building data management and client relationship software for sports clubs around the world.</p>\n<p>This is an entry-level position and no previous commercial experience is required.</p>\n<p><b>About you: </b></p>\n<ul>\n<li>Excellent communication and interpersonal abilities</li>\n<li>Good problem-solving and analytical skills</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Any interest in sport would be a bonus but not essential</li>\n</ul>\n<p><b>The role: </b></p>\n<p>You will work closely alongside Data Architect and Senior Database Developers and operations and management team. You will demonstrate a high degree of independence, responsibility and professionalism, and be fluent in written and spoken English.</p>\n<p><b>Relevant skills: </b></p>\n<ul>\n<li>MS SQL Server</li>\n<li>C#</li>\n<li>Microsoft .NET framework 4.0 +</li>\n</ul>\n<p>We are particularly keen to hear from individuals with a natural enthusiasm for tech that will help us develop our existing products. This could be knowledge gained through employment or from a personal interest perspective.</p>\n<p><b>How to apply: </b></p>\n<p>To apply for this role, you should visit http://bit.ly/2SKNqEI to create an account and fill out a profile which will then be used as your application.</p>\n<p>Job Type: Full-time</p>\n<p>Salary: £24,000.00 to £28,000.00 /year</p>\n</div>\n"
    },
    {
      "title": "Food Product Developer",
      "company": "Marks & Spencer",
      "location": "London",
      "salary": "£19,500 a year",
      "summary": "Food Product Development KEY INFORMATION Location: Head Office (London) Duration: 12 months Salary: £19,500, pro rata About the programme At M&S, we’re...",
      "link": "https://www.indeed.co.uk/rc/clk?jk=f8a893ede71fa4ef&fccid=ae3ed1b6cbd83168&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item \">£19,500 a year</div></div>\n<div><div>\n<b>Food Product Development</b><br>\n<p><b>KEY INFORMATION</b></p>\n<br>\n<p><b>\nLocation:</b> Head Office (London)\n</p>\n<br>\n<p><b>Duration:</b> 12 months\n</p>\n<br>\n<p><b>Salary:</b> £19,500, pro rata\n</p>\n<br>\n<p><b>About the programme</b></p>\n<br>\n<p>\nAt M&amp;S, we’re known for the quality, innovation and creativity of our food. So as someone who’s studying for a food-related qualification (can we tailor to reflect the subjects quoted in the killer questions), what could be better than helping us to make it even better?\n</p>\n<br>\n<p>This placement will see you work with some of the food industry’s brightest minds, helping to improve on our existing recipes, while developing delicious new ideas to inspire the millions of customers who shop with us every week. This will involve spending time in our stores to see the impact of what we create, and working with our network of suppliers to discover how we build the delicious combinations offered in-store. And after your six-month placement with us is finished, we’ll even help you secure a further six-month placement with one of our suppliers – ensuring you get a full and rounded view of the industry.\n</p>\n<br>\n<p>In this vital and highly creative part of our business, we’re looking for you to bring your fresh thinking and genuine passion for food. In return, you’ll be transformed in a real professional with excellent career prospects. What could be more satisfying than working with people to create the most amazing food experiences?\n</p>\n<br>\n<p>Click below to apply.</p>\n</div></div>\n</div>\n"
    },
    {
      "title": "Junior Web Developer (no experience)",
      "company": "CoderList",
      "location": "London",
      "salary": "£22,000 - £30,000 a year",
      "summary": "We are working with a great London based company in the digital publishing space looking to rapidly grow their junior developer programme....",
      "link": "https://www.indeed.co.uk/company/CoderList/jobs/Junior-Web-Developer-3ddc29d4c08e61aa?fccid=80877499a43578a8&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item \">£22,000 - £30,000 a year</div></div>\n<p><b>Intro</b></p>\n<p>At CoderList our sole focus is to help talented <b>junior</b>developers secure their <b>very first job</b>in tech.</p>\n<p>We are working with a great London based company in the digital publishing space looking to rapidly grow their junior developer programme. The company are seeking front-end, back-end, and full-stack junior developers to join the team in the London office.</p>\n<p>All positions are entry-level, and no previous commercial experience is required.</p>\n<p>Application instructions at the bottom of the page.</p>\n<p><b>The role</b></p>\n<p>Successful candidates will be working as entry-level developers in a collaborative team on all stages of development, from conception through to delivery and maintenance. Working underneath the development manager, they will be responsible for supporting multiple projects, including existing infrastructure and new solutions. Successful applicants will also work closely with ticketing systems, helping to deal with technical support issues as they arise.</p>\n<p><b>Requirements &amp; Skills</b></p>\n<p>We are more concerned with passion and potential than with what specific technologies you know, and further training and mentoring will be provided during the role.</p>\n<p>However, for this position you should:</p>\n<ul>\n<li>Have a passion for technology</li>\n<li>Be able to work and learn independently</li>\n<li>Be a creative thinker able to find innovative solutions</li>\n<li>Be a great communicator able to clearly discuss your work with others</li>\n<li>Be able to manage your own workload</li>\n<li>Be proficient in working to agreed KPIs</li>\n</ul>\n<p>In addition to this, you should have a decent grounding in the relevant web technologies for the role you are interested in. For example, HTML, CSS and JavaScript if you are interested in front-end positions, and at least one back-end language and database (e.g. PHP, Ruby, Python, C# + PostgreSQL, MySQL) for full-stack or back-end roles. You do not, however, need to be an expert, and we look for potential rather than mastery.</p>\n<p><b>Applying</b></p>\n<p>To match with this role and others, you should visit http://bit.ly/2QiJyNH to create an account and fill out a profile which will then be used to match you with positions.</p>\n<p>Job Type: Full-time</p>\n<p>Salary: £22,000.00 to £30,000.00 /year</p>\n</div>\n"
    },
    {
      "title": "Junior Front-End Developer",
      "company": "Camelot Global",
      "location": "London",
      "salary": "",
      "summary": "At least 2+ years working full time as a front-end/javascript developer. We are looking for a brilliant Javascript/Front-end Developer to come and join us at...",
      "link": "https://www.indeed.co.uk/rc/clk?jk=c4ab8837c28ffafb&fccid=fb98efcf71fa1fec&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div>\n<p>Here at Camelot Lottery Solutions we have a real ambition to develop the best tools and platforms within the global lottery industry. We are looking for a brilliant Javascript/Front-end Developer to come and join us at our global HQ in central London and be part of an exciting journey where we will not only utilise your front-end skills but we will also put you on a track of developing your skills in other niche areas to help support our customers and other teams internally in building a real time Big Data platform that supports reporting, analytics, and powers a best in class digital marketing stack.</p>\n<p><b>\nA bit about what you’ll be doing with us:</b></p>\n<p>\nAs part of our Global BI and CRM product unit. The team’s objective is to build a full omni channel analytics and CRM capability supporting both greenfield and complex integrations to existing legacy architectures for Lottery customers. We help develop areas of our marketing stack that our customers use to optimise and influence user journeys. build a consistent and timely omni-channel strategy, and get a better understanding of users behaviours and campaign attribution by capturing digital data and funnelling it to web analytics solutions and the big data platform.<br>\n</p>\n<p><b>Requirements</b></p>\n<p><b>\nWhat skills we need to see from you:</b></p>\n<ul>\n<li>At least 2+ years working full time as a front-end/javascript developer</li>\n<li>The desire to learn and develop your skills to the next level</li>\n<li>Experience in responsive design</li>\n<li>Experience of working with vanilla Javascript</li>\n<li>Experience manipulating the DOM</li>\n<li>Basic knowledge of various Web API’s and how to integrate with 3rd party systems</li>\n</ul>\n</div></div>\n"
    },
    {
      "title": "Software Developer",
      "company": "G-Research",
      "location": "London WC1E",
      "salary": "£75,000 - £130,000 a year",
      "summary": "You will be an intelligent, capable and hands-on developer who has an excellent academic background. We are looking for the world’s foremost developers and take...",
      "link": "https://www.indeed.co.uk/company/AMS/jobs/Software-Developer-8a4ce755a947c50b?fccid=0289bc495991c482&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item \">£75,000 - £130,000 a year</div></div>\n<p><b>Imagine writing the code at the core of your company’s success </b></p>\n<p>G-Research is a leading quantitative research and technology company. By using the latest scientific techniques, we produce world-beating predictive research and build advanced technology to analyse the world’s data.</p>\n<p>Software Engineering is core to our business. By designing and implementing real-time systems, our engineers are solving some of the world’s most complex financial problems.</p>\n<p><b>The Role</b></p>\n<p>We are looking for the world’s foremost developers and take recruitment of the best talent very seriously. Most of our systems are written in C# but we also have specialist teams using C++, Java and F#. We also utilise modern web, distributed and big data technologies, so we have a broad range of software development challenges for the right person.</p>\n<p>This is an opportunity to be part of our journey to build a world-leading software development practice. We are working hard to embed a Continuous Improvement culture &amp; philosophy across the organisation and are striving to learn from the best practitioners in the industry.</p>\n<p><b>Who are we looking for?</b></p>\n<p>The ideal candidate will at minimum have experience in the following areas:</p>\n<ul>\n<li>You will be an intelligent, capable and hands-on developer who has an excellent academic background</li>\n<li>Have a genuine interest in both software technology &amp; the underlying hardware.</li>\n<li>You will demonstrate a proven ability to develop high-quality software in an OO language</li>\n<li>Have an appreciation of good software architecture, CompSci fundamentals &amp; data structures</li>\n<li>Working knowledge of Agile, Continuous Delivery and TDD principles.</li>\n</ul>\n<p><b>Why should you apply?</b></p>\n<ul>\n<li>Highly competitive compensation plus annual discretionary bonus</li>\n<li>Informal dress code and excellent work/life balance</li>\n<li>Comprehensive healthcare and life assurance</li>\n<li>25 days holiday</li>\n<li>Contributory pension scheme</li>\n<li>Cycle-to-work scheme</li>\n<li>Subsidised gym membership</li>\n<li>Monthly company events</li>\n<li>Central London office close to 5 stations and 6 tube lines</li>\n</ul>\n<p>Opening Date 12/12/18</p>\n<p>Closing Date 09/01/19</p>\n<p>Job Type: Full-time</p>\n<p>Salary: £75,000.00 to £130,000.00 /year</p>\n<p>Experience:</p>\n<ul><li>software development: 1 year (Required)</li></ul>\n</div>\n"
    },
    {
      "title": "Food Product Developer",
      "company": "Harrods Limited",
      "location": "London SW1X",
      "salary": "",
      "summary": "Developer to join our talented team. Searching for a delectable career opportunity?...",
      "link": "https://www.indeed.co.uk/rc/clk?jk=f7daecbff00515d5&fccid=a215cb2b2520e59a&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<b>Job Description:</b><br>\nSearching for a delectable career opportunity?\n<br>We need an experienced and imaginative Food Product\n<br>Developer to join our talented team.\n<br>Keeping an eagle eye on the market, you’ll identify\n<br>emerging trends and envision innovative and\n<br>palate-pleasing products.\n<br>Working with the Buying team, it will be up to you to\n<br>devise an appropriate Own Label Strategy for each\n<br>category, ensuring it aligns with the overall business\n<br>strategy.\n<br>You will need the pragmatic nature to gauge whether a\n<br>concept is commercial, as well as the project management\n<br>experience to meet tight deadlines while balancing\n<br>multiple responsibilities.\n<br>With your proactive and hands-on approach, you’ll liaise\n<br>with chefs and suppliers, coordinating tastings to\n<br>ensure requirements are understood and the finished\n<br>product meets our impeccable standards.\n<br>Using your exceptional communication skills, you’ll work\n<br>with teams across the business, and build strong\n<br>relationships with a wide variety of vendors. You’ll\n<br>have the resilience and self-assurance to advise and\n<br>persuade when necessary.\n<br>To be successful, you must have an impressive background\n<br>in Food Product Development. You will have a true\n<br>passion for food, combined with an unbeatable\n<br>understanding of the luxury customer. Packaging design\n<br>experience would be highly beneficial, but is not\n<br>essential.\n<br>If you would savour this role, apply now.</div>\n"
    },
    {
      "title": "Business Developer to develop opportunities and close deals",
      "company": "Orsted Germany",
      "location": "London",
      "salary": "",
      "summary": "Business Developer to develop opportunities and close deals. Are you an experienced business developer who wants to lead the sale of our Route-to-Market...",
      "link": "https://www.indeed.co.uk/rc/clk?jk=877931b44673fc3b&fccid=70d5901ea9f06e45&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div>\n<div><b>Business Developer to develop opportunities and close deals</b></div>\n<div><i>Are you an experienced business developer who wants to lead the sale of our Route-to-Market Services?</i></div>\n<br>\n<div>Join us as a Business Developer in our growing Power Origination team where you’ll be developing new business opportunities and closing deals in the UK for the sale and purchase of power. The Power Origination team develops innovative ways to manage risk and create value from our company’s power portfolio.</div>\n<br>\n<div><b>Your key tasks will be to</b></div>\n<ul>\n<li>lead the selling of route-to-market services and risk management products</li>\n<li>build and maintain strong relationships with counterparts</li>\n<li>coordinate tender responses and participate in contract negotiations</li>\n<li>qualify opportunities and attend meetings to support origination deals</li>\n<li>work closely with the team to identify opportunities for new products and services.</li>\n</ul>\n<br>\n<div>Furthermore, you maintain good working relationships with internal stakeholders.</div>\n<br>\n<div><b>Your competences include that you</b></div>\n<ul>\n<li>have a proven ability to identify, negotiate and close new business</li>\n<li>demonstrate a good understanding of the UK energy market</li>\n<li>have the ability to work independently and as part of a team</li>\n<li>are proactive and analytical in your approach to work tasks</li>\n<li>are an excellent communicator and presenter.</li>\n</ul>\n<br>\n<div>Moreover, you’re are educated to degree level or higher and you speak and write English fluently. Most important of all is that you’re a self-starter, enjoy a fast-paced work environment and the satisfaction of closing deals.</div>\n<br>\n<div><b>Working at Ørsted</b></div>\n<div>To be the frontrunner in the green energy transformation, we invest significantly in innovation and empower our employees to help shape the renewable energy technologies of the future. We cultivate a collaborative, dynamic and diverse work environment and encourage career-long learning and development so our people can realise their full potential.</div>\n<br>\n<div><b>Would you like to help shape the renewable technologies of the future?</b></div>\n<div>Send your application to us as soon as possible and no later than 18 January 2019, as we’ll be conducting interviews on a continuous basis.</div>\n<br>\n<div>All UK-based positions will be subject to satisfactory pre-employment screening, further details will be given at offer stage</div>\n<br>\n<div>Please note that for your application to be reviewed, you must submit your application via our online career pages.</div>\n<br>\n<div>You should expect travelling both in the UK and Europe in relation to your work.</div>\n<br>\n<div><b>About Ørsted</b></div>\n<div>Headquartered in Denmark, Ørsted’s 6,000 employees develop, construct and operate offshore wind farms, bioenergy plants and innovative waste-to-energy solutions and provide smart energy products to its customers. Ørsted Customer Solutions’ 500 employees deliver state-of-the-art smart energy solutions and handle all aspects related to purchasing, selling and distributing energy. For more information on Ørsted, visit orsted.com.</div>\n</div></div>\n"
    },
    {
      "title": "Business Developer to develop opportunities and close deals",
      "company": "Orsted",
      "location": "London",
      "salary": "",
      "summary": "Business Developer to develop opportunities and close deals. Are you an experienced business developer who wants to lead the sale of our Route-to-Market...",
      "link": "https://www.indeed.co.uk/rc/clk?jk=bda99feddb7a7fc8&fccid=d4f90cc00660642a&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div><div><div>\n<div><b>Business Developer to develop opportunities and close deals</b></div>\n<div><i>Are you an experienced business developer who wants to lead the sale of our Route-to-Market Services?</i></div>\n<br>\n<div>Join us as a Business Developer in our growing Power Origination team where you’ll be developing new business opportunities and closing deals in the UK for the sale and purchase of power. The Power Origination team develops innovative ways to manage risk and create value from our company’s power portfolio.</div>\n<br>\n<div><b>Your key tasks will be to</b></div>\n<ul>\n<li>lead the selling of route-to-market services and risk management products</li>\n<li>build and maintain strong relationships with counterparts</li>\n<li>coordinate tender responses and participate in contract negotiations</li>\n<li>qualify opportunities and attend meetings to support origination deals</li>\n<li>work closely with the team to identify opportunities for new products and services.</li>\n</ul>\n<br>\n<div>Furthermore, you maintain good working relationships with internal stakeholders.</div>\n<br>\n<div><b>Your competences include that you</b></div>\n<ul>\n<li>have a proven ability to identify, negotiate and close new business</li>\n<li>demonstrate a good understanding of the UK energy market</li>\n<li>have the ability to work independently and as part of a team</li>\n<li>are proactive and analytical in your approach to work tasks</li>\n<li>are an excellent communicator and presenter.</li>\n</ul>\n<br>\n<div>Moreover, you’re are educated to degree level or higher and you speak and write English fluently. Most important of all is that you’re a self-starter, enjoy a fast-paced work environment and the satisfaction of closing deals.</div>\n<br>\n<div><b>Working at Ørsted</b></div>\n<div>To be the frontrunner in the green energy transformation, we invest significantly in innovation and empower our employees to help shape the renewable energy technologies of the future. We cultivate a collaborative, dynamic and diverse work environment and encourage career-long learning and development so our people can realise their full potential.</div>\n<br>\n<div><b>Would you like to help shape the renewable technologies of the future?</b></div>\n<div>Send your application to us as soon as possible and no later than 18 January 2019, as we’ll be conducting interviews on a continuous basis.</div>\n<br>\n<div>All UK-based positions will be subject to satisfactory pre-employment screening, further details will be given at offer stage</div>\n<br>\n<div>Please note that for your application to be reviewed, you must submit your application via our online career pages.</div>\n<br>\n<div>You should expect travelling both in the UK and Europe in relation to your work.</div>\n<br>\n<div><b>About Ørsted</b></div>\n<div>Headquartered in Denmark, Ørsted’s 6,000 employees develop, construct and operate offshore wind farms, bioenergy plants and innovative waste-to-energy solutions and provide smart energy products to its customers. Ørsted Customer Solutions’ 500 employees deliver state-of-the-art smart energy solutions and handle all aspects related to purchasing, selling and distributing energy. For more information on Ørsted, visit orsted.com.</div>\n</div></div></div></div>\n"
    },
    {
      "title": "Appian Developer – London",
      "company": "Capgemini",
      "location": "London",
      "salary": "",
      "summary": "We are looking to recruit an Appian Developer across the Digital practice based in London. The focus of your role....",
      "link": "https://www.indeed.co.uk/rc/clk?jk=92b351c6f2b5d170&fccid=105ecfd0283f415f&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item  icl-u-xs-mt--xs\">Permanent</div></div>\n<div><div><div><div>\n<p><b>The focus of your role</b>\n</p>\n<br>\n<p>We are looking to recruit an Appian Developer across the Digital practice based in London. This is a permanent position and represents a unique opportunity for someone to enhance their digital consulting career.</p>\n<br>\n<br>\n<br>\n<br>\n<p><b>What you’ll do</b>\n</p>\n<ul>\n<li>Experience in consulting methodologies such as process mapping, requirements gathering and running workshops</li>\n<li>Experience in agile methodologies building solutions in cross-functional teams</li>\n<li>Experience in designing the Appian solution architecture, process discovery and gap analysis.</li>\n<li>Work with clients throughout the entire life-cycle of projects to scope, define, design, and implement solutions</li>\n<li>Design and implement solutions with Appian software and provide demonstrations and proof of concepts</li>\n<li>Supervise, mentor and develop resources on implementation best practices both onsite and offshore</li>\n<li>Identifying, managing and mitigating risks and issues throughout the delivery lifecycle</li>\n</ul>\n<br>\n<br>\n<br>\n<p><b>What you’ll bring</b>\n</p>\n<ul>\n<li>Experienced in designing and implementing Appian 18.x solutions</li>\n<li>Knowledge of Appian architecture and its objects &amp; best practices</li>\n<li>Good understanding of database concepts and strong working knowledge any one of the major databases e.g. Oracle, SQL Server &amp; MySQL</li>\n<li>Experience of integrations using web services (e.g. XML, REST, WSDL, SOAP), API, JDBC, JMS</li>\n<li>Understanding on how to implement LDAP, SAML configuration</li>\n<li>Appian administration</li>\n</ul>\n<br>\n<br>\n<br>\n<p><b>About Capgemini</b>\n</p>\n<br>\n<p>With more than 190,000 people, Capgemini is present in over 40 countries and celebrates its 50th Anniversary year in 2017. A global leader in consulting, technology and outsourcing services, the Group reported 2016 global revenues of EUR 12.5 billion. Together with its clients, Capgemini creates and delivers business, technology and digital solutions that fit their needs, enabling them to achieve innovation and competitiveness. A deeply multicultural organisation, Capgemini has developed its own way of working, the Collaborative Business ExperienceTM, and draws on Rightshore®, its worldwide delivery model.</p>\n<p>\nLearn more about us at www.capgemini.com</p>\n<p>\nRightshore® is a trademark belonging to Capgemini</p>\n<br>\n<br>\n<br>\n<p><b>What we’ll offer you</b>\n</p>\n<br>\n<p>Professional development. Accelerated career progression. An environment that encourages entrepreneurial spirit. It’s all on offer at Capgemini. And although collaboration is at the core of the way we work, we also recognise individual needs with a flexible benefits package you can tailor to suit you</p>\n<br>\n<br>\n<br>\n<p><b>Why we’re different</b>\n</p>\n<br>\n<p>At Capgemini, we help organisations across the world become more agile, more competitive and more successful. Smart, tailored, often-groundbreaking technical solutions to complex problems are the norm. But so, too, is a culture that’s as collaborative as it is forward thinking. Working closely with each other, and with our clients, we get under the skin of businesses and to the heart of their goals. You will too.</p>\n<p>\nCapgemini positively encourages applications from suitably qualified and eligible candidates regardless of sex, race, disability, age, sexual orientation, gender reassignment, religion or belief, marital status, or pregnancy and maternity. We are committed to hiring, developing and retaining the best people to deliver innovative, world-class solutions for our clients. We foster an inclusive culture that enables everyone to achieve their full potential and enjoy a fulfilling career with us. Our comprehensive flexible benefits package and lifestyle policies enable our employees to balance their individual, family and work-life needs.</p>\n</div></div></div></div>\n</div>\n"
    },
    {
      "title": "Junior Software Developer",
      "company": "Merkle Periscopix",
      "location": "London SE1",
      "salary": "",
      "summary": "Life as a Junior Software Developer. Work with developers to plan project pipelines and work distribution....",
      "link": "https://www.indeed.co.uk/rc/clk?jk=0b8d5fb1ff41b88a&fccid=4af320ba68a6c707&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div>Job Description<br>\n<br>\n<p><b>Life as a Junior Software Developer</b></p>\n<p>\nAs our junior developer you will receive on the job training, work with cutting edge technology and be given the freedom to learn independently and work autonomously while still being part of a supportive and collaborative basis.</p>\n<p>\nRole Objectives</p>\n<ul>\n<li>Successfully deliver technical solutions that support the wider business.</li>\n<li>Efficiently work to build internal tools on time and to scope.</li>\n<li>Maintain internal coding best practices.</li>\n</ul>\n<p>\nKey Relationships</p>\n<ul>\n<li>Work with developers to plan project pipelines and work distribution.</li>\n<li>Engagement with stakeholders on a project-by-project basis.</li>\n</ul>\n<p>\nResponsibilities</p>\n<ul>\n<li>Design and build solutions using a variety of frameworks and languages, with a focus on React and .Net Core.</li>\n<li>Improve development capabilities through upskilling, training and on-the-job experience with an aim to become particularly adept in JavaScript (ES6), React and C#.</li>\n<li>Receive project briefs and plan an appropriate solution with support from other developers.</li>\n<li>Optimise, troubleshoot and maintain tools and solutions.</li>\n<li>Present solutions back to key stakeholder within the agency, soliciting feedback and the need for any follow ups.</li>\n</ul>\n</div>\n<br>\n<div>Qualifications<br>\n<br>\n<p>We will offer full on the job training, however, the following skills would be required:</p>\n<ul>\n<li>Demonstrable skills and knowledge in at least JavaScript or C#</li>\n<li>Ability to design and write reliable, maintainable code.</li>\n<li>Strong problem-solving skills</li>\n<li>Clear, accurate and concise written and verbal communication</li>\n<li>Comfortable working in a fast and agile environment</li>\n<li>Understand concepts of Object Orientated Programming (this can be self-taught or part of a module at university)</li>\n</ul>\n<br>\nAdditional Information<br>\n<br>\n<p>As we progress and develop as a company, you will too. Within our fast-growing company, there’s plenty of opportunity to develop your skill set and you’ll be encouraged to be curious and share new ideas. In exchange for your contribution to our award-winning company, we make sure you take advantage of a generous holiday allowance and are paid a competitive salary. We’re really proud of our company values and culture; we have regular company / team socials and want all our employees to enjoy coming into work.</p>\n<p>\nSome of our benefits include:</p>\n<ul>\n<li>\nFriendly, approachable office atmosphere - and business-casual dress code</li>\n<li>\nFree breakfast (toast, spreads, fresh fruit, coffee, tea)</li>\n<li>\nRegular company socials (including bowling, Crystal Maze, quiz nights, annual Christmas and Summer parties to name a few!)</li>\n<li>\nOn-site Games Room with ping pong and pool table</li>\n<li>\nThe company pays for our lunch on the last Friday of every month</li>\n<li>\nOn Friday’s at 4:30pm (Four Thirsty) everyone can help themselves to a celebratory drink</li>\n<li>\nCycle2Work scheme, free eye tests, a company mobile phone and season ticket loans (post 3-month probation)</li>\n</ul>\n<p><i>\nAt the point of application, the candidate must have the legal right to work in the UK as we are unable to sponsor visas as this time.</i></p>\n<p><i>\nMerkle does not discriminate against job applicants on the basis of age, disability, gender reassignment, marital or civil partner status, pregnancy or maternity, race, colour, nationality, ethnic or national origin, religion or belief, sex or sexual orientation. Experience stipulated in this job description serves as a guide only and all applications will be considered on their merits, irrespective of experience.</i></p>\n<p><i>\nAs part of our Diversity and Inclusion agenda, and as an Equal Opportunities employer, if you require reasonable adjustments during the selection process please engage directly with your Recruiter.</i></p>\n</div>\n</div>\n"
    },
    {
      "title": "Software Developer",
      "company": "AWAX",
      "location": "London",
      "salary": "£45,000 - £50,000 a year",
      "summary": "Experience hiring of technical resources, including developers & testers. Ensure all software developed is of a robust and high-quality nature meeting the...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0AglJ-dploO7XRgbJEguDg-riHeGz3mUWjG98y9lAE2kwl34e9pZEkkfXg_Rjti5yMUfArVAQZp2iv6xHknW_UpEmAVfPzd6BNvRVXbvidqAMLCOy81YvGaxPlwLjF4khbMMeQxB2-Yr2nKKHARwjuQi6OdXtiZP7r2meiOCYwR433LGD11TCYbln6l602mBw_F-0rlHtEy60GRJLmNUbUQo59e6xJv96jya0GvRDGshhTzVrVNNbDoiA5ED0NKSdgiI6cFaklsSr6vSIcD5sxWJUdPDoEEGF9btkAK7dDa4IVyEwPlc6xzBNRcspxNb-KoVZIVxx0yDNl1vVg-oZQWgwbd7keAHWxxMu5xi8oDy2mI_on24GdvyLs09-y457rjuwnHxlQQPacyXjZV5rbCWsRJYQGDNwQO3zXD8Umm9yaQJ8XBYcd5&vjs=3&p=6&sk=&fvj=1",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item \">£45,000 - £50,000 a year</div></div>\n<p><b>Responsibilities: </b></p>\n<ul>\n<li>Ensure all software developed is of a robust and high-quality nature meeting the requirements of the agreed specifications and complying with Unminds formal and informal development team standards and procedures</li>\n<li>Build reusable, extensible code that is easily worked on by other team members</li>\n<li>Ship both large and small features independently</li>\n<li>Investigate and implement bug fixes and performance improvements</li>\n<li>Ability working across multiple application and technology domains</li>\n</ul>\n<p><b>The following experience is required: </b></p>\n<ul>\n<li>Significant experience with bespoke built applications on a Microsoft desktop platform</li>\n<li>Expert knowledge of C# / .Net applications development</li>\n<li>.Net Frameworks</li>\n<li>WPF, MFC, XML, JSON, GDI, WINDOWS API, DLL</li>\n<li>CI/CD, Jenkins, GIT</li>\n<li>Experience applying automating testing frameworks enabling TDD &amp; BDD</li>\n<li>Experience implementing Agile Methodologies and tools</li>\n<li>Experience hiring of technical resources, including developers &amp; testers</li>\n<li><b>Immediate Start </b></li>\n</ul>\n<p>Job Type: Full-time</p>\n<p>Salary: £45,000.00 to £50,000.00 /year</p>\n<p>Experience:</p>\n<ul><li>software development: 4 years (Required)</li></ul>\n</div>\n"
    },
    {
      "title": "Blockchain Developer",
      "company": "AWAX",
      "location": "London",
      "salary": "",
      "summary": "As a Blockchain Developer you’ll be responsible for:. As blockchain developer you will be responsible for designing, implementing, and supporting a DApp on a...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0AglJ-dploO7XRgbJEguDg-riHeGz3mUWjG98y9lAE2kwl34e9pZEkkkIRJ_TW-DWvx9YARcr7IFJNTfiob5AxwyJRhT8BOoVPDi0Fah6xrPYAV2KkN3u3rhOEVtWCWk008S6bNS_nEV1EVZgy-21I-7tX89A1d50Zmf23x9_WKBmlLVAzNpjP0RRKfdriYw_sSVtMq60WmrRHt_43b2ZBk6jjyoqab1_-_6kMxyKeW4TTEhgZnENyNIcmzmr3tcyzs62f2AucPOgaI7k556UQH_oFzMNlio1IDD_VyFqWiZjfogDr6lOfl74HwPVaGcDy20eE0wjmqV3F_qM-KMN8ks-_BRgwu_WoAAESd4KIZcPpLhyP5S2Ls8kPPfd0m_jTpMeK3R9y6UVd176QvSfPnjD6jfqNEA3skyYJKnTPQuDNN0jeicDmZPelG7nu6LWA=&vjs=3&p=7&sk=&fvj=1",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item  icl-u-xs-mt--xs\">Permanent</div></div>\n<p><b>Job Description</b><br>As blockchain developer you will be responsible for designing, implementing, and supporting a DApp on a blockchain network. Your primary responsibility will be analyzing requirements, designing and implementing critical sections of the<br>blockchain storage, architecture and infrastructure, designing and developing the smart contract ecosystem and solving industry challenges with the use of blockchain technology.</p>\n<p><b>Job Type / Category</b></p>\n<p>As a Blockchain Developer you’ll be responsible for:</p>\n<ul>\n<li>Research, design, develop, and test blockchain technologies</li>\n<li>Brainstorm and help evaluate applications for new tools and technologies as they continually evolve</li>\n<li>Maintain and extend current client- and server-side applications responsible for integration and business logic</li>\n<li>Be involved in the global blockchain community—work on implementing and integrating the latest improvement proposals</li>\n<li>Document new solutions as well as maintaining that of existing ones</li>\n</ul>\n<p><b>Required Education, Skills and Qualifications</b></p>\n<p>The ideal candidate for the role will possess:</p>\n<ul>\n<li>Strong software development background</li>\n<li>Experience working with Ethereum, Solidity and smart contracts in your spare time or in production</li>\n<li>Knowledge of Nervos, DFINITY and NEO</li>\n<li>Production experience working with the latest standards ES6ES7, server side NodeJS and experience client side with frameworks such as ReactJS, VueJS and Python</li>\n<li>Experience working with large codebases</li>\n<li>Experience working with open-source projects</li>\n<li>Strong knowledge of common algorithms and data structures</li>\n<li>Familiarity with basic cryptography</li>\n<li>Familiarity with P2P networks</li>\n<li>Strong knowledge of concurrency and writing efficient and safe multithreaded code</li>\n<li>Strong knowledge of STL, C++11</li>\n<li>Proficiency in the QT Widgets module</li>\n<li>Problem solver mentality - an ability to break down problems which might not have been solved in industry.</li>\n<li>Capacity to work under pressure and to deadlines</li>\n<li>Confidentiality is essential</li>\n<li>Flexibility and be open to change</li>\n<li>Initiative, self-motivated</li>\n<li>Work co-operatively with others as part of a team</li>\n</ul>\n<p><b>Immediate Start </b></p>\n<p>Job Types: Full-time, Permanent</p>\n<p>Experience:</p>\n<ul>\n<li>javascript: 3 years (Required)</li>\n<li>development: 3 years (Required)</li>\n</ul>\n</div>\n"
    },
    {
      "title": "NetSuite Developer",
      "company": "Mimecast",
      "location": "London",
      "salary": "",
      "summary": "The NetSuite Developer works in conjunction with the project architects and the broader business team to build NetSuite-based solutions to meet the business...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0DfVJ4i74vC6hjtXAveDfy4EYCTTj9PoPbyskc7UEbU0Wh3sLZdg1Rqf3hZLF2RcIQH6a6NynM4b_CfwteuMc1tNakFgXS1aBlrNENU_GtvueG9uoKxcUNHDPB5zz-ozc2frpEUmtC5Aven906VUlxm0Oxnfy4SvG5lWXf0YI-ZBpB7rp075Q5udxtV15n1hpMd6lkaE_rCKWB_u2AaX9hWmaZpCRMnrG9JRIVHfhChWrJIwd5C2utp0zPYAqd_PbkeCYoAA3ztwW6_WP5w0SNqmwhi5NR0TRSaHqpJ-Kzz1BOviFXP-oUv5xstPXek5LJfYk7xsYOvG6duY4spEeKx94SJui-PYi2oAhJ2ijoHyIptqJ44oejq1dbMhiVT2OrldEArlnpj4Q==&vjs=3&p=8&sk=&fvj=0",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div>\n<b>ID </b>2018-3045<br>\n<b>Job Location(s) </b>UK-London<br>\n<b>Position Type </b>Permanent - Full Time<br>\n<br>\n<b>More information about this job:</b><br>\n<b>Overview</b><br>\n<br>\nThe NetSuite Developer works in conjunction with the project architects and the broader business team to build NetSuite-based solutions to meet the business needs. Depending on the nature of the project, this role will be required to configure the solution within the NetSuite platform and/or perform custom development and may be called on to assist with activities like scoping and documentation.<br>\n<br>\n<b>Responsibilities</b><br>\n<br>\n<ul>\n<li>Work closely with Business Analysts to translate business requirements into wellarchitected solutions that best leverage the NetSuite product</li>\n<li>\nDevelop, test, document and maintain out of the box and / or custom solutions, integrations, and data migration elements of a NetSuite implementation</li>\n<li>\nParticipate in technical design sessions; develop technical solution documentation aligned with the business objectives</li>\n<li>\nExecute test plans to ensure quality delivery</li>\n<li>\nFollow coding standards and participate in code reviews during projects to ensure appropriate design patterns are followed</li>\n<li>\nProvide estimates and work breakdown structures for assigned tasks</li>\n<li>\nAbsorb technical capabilities from NetSuite during new product releases and acquisitions</li>\n<li>\nCreate innovative ways to integrate with other business systems</li>\n</ul>\n<br>\n<br>\n<br>\n<b>Qualifications</b><br>\n<br>\n<ul>\n<li>5+ years of progressively responsible experience in a Business Systems role, providing hands-on recommendations for process and systems improvement, while undertaking various development projects</li>\n<li>\nProven ability to develop and optimize integrated business processes across disparate systems</li>\n<li>\n3+ years' experience being a key stakeholder in a NetSuite (or ERP tool) implementation</li>\n<li>\n2+ years of developing, configuring, and supporting the NetSuite product</li>\n<li>\nExtensive development experience using SuiteScript, building Suitelets, RESTlets, User Events, Scheduled scrips, building reports and APIs to respond to technical and non-technical users</li>\n<li>\nAbility to perform automated testing and write unit tests</li>\n<li>\nExperience with full lifecycle development</li>\n<li>\nFamiliarity with agile software delivery methodologies and tools such as Scrum, Jira, Rally or Agile Accelerator</li>\n<li>\nExcellent written and oral communications skills</li>\n<li>\nActive NetSuite certifications or ability to achieve relevant certifications upon hire</li>\n<li>\nRequirements, design, testing, documentation, implementation, and support</li>\n<li>\nAdvocate of best practices, design principles and development methodologies</li>\n<li>\nA highly-accomplished communicator, both in senior management settings as well on a one to one basis</li>\n<li>\nAbility to articulate process changes and improvements up and down the organization</li>\n<li>\nAt ease in leveraging virtual resources and teaming to drive projects to on time completion</li>\n<li>\nCollaborative team player with excellent interpersonal skills</li>\n</ul>\n<br>\n<br>\n<br>\n<b>Reward</b><br>\n<br>\nWe offer a highly competitive rewards and benefits package including private healthcare, dental and life coverage. Mimecast is an entrepreneurial and high growth company which will provide the right candidate with a wealth of career development opportunities. All Mimecasters strive on being high performers, problem solvers, and team players with passion and integrity.<br>\n<br>\n<br>\nMimecast is a global company with certain business operations in North America. By responding to this advertisement you are agreeing to your details, including any personally identifiable information therein, to be transferred to Mimecast North America, Inc. Mimecast North America, Inc will maintain adequate technical and organizational measure to protect your personally identifiable information and shall use it for the purposes of assessing suitability for this role. Should you wish to respond to this advertisement but do not consent to such transfer, please notify us in advance so that we are able to make alternative arrangements.<br>\n<br>\n<br>\n#LI-RT1<p>\nPI105800111</p>\n</div></div>\n"
    },
    {
      "title": "iOS Developer",
      "company": "AWAX Ltd",
      "location": "London",
      "salary": "",
      "summary": "As the iOS Developer, you will…*. Play a key role in building AWAX mobile presence, as well as the development of AWAX as a company....",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0AglJ-dploO7XRgbJEguDg-riHeGz3mUWjG98y9lAE2kwl34e9pZEkkKiqyCLTS7WZEkM5i-t-2ahOqFdVg0fsgebcZDZuAjyvtN6AJJrKfZmC0uKYZMrBwbVF6RfkCcihSOb15wyRCaIBTi-2j-YqrQHOjGxg3AVp0tYku3luL_ck_nryiFBcNqo-o70OUR4pyD4xCUmr7SxcMF4qFq7mMoOAXXiubuX6XeKsmToLhvGu4vuoZQXb4bCuEuyc4t_PZx3byGJH-WtmkZlFXme6-ZuyU2sOsC9gqhEbQIhcq-rL3MlaHOY-Tn8Bl0061rTGUstlNdjaBjJDU8IzQS1z2l4HDXeOGcfDU4arBtyk2cs_0gJBGkKAi93ySrIwJx0yIDe7f87GZn4zowe-ML8hvsRm3GN46hYPFggfFAsGAod3kSqDDcWqu&vjs=3&p=9&sk=&fvj=1",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\">\n<div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item  icl-u-xs-mt--xs\">Permanent</div></div>\n<p><b>As the iOS Developer, you will…</b></p>\n<ul>\n<li>Play a key role in building AWAX mobile presence, as well as the development of AWAX as a company.</li>\n<li>Solve intellectually stimulating challenges in an industry poised for disruption.</li>\n<li>You’ll create tech that uses vasts amount of transactional data and applies artificial intelligence engines to improve the financial well being of the users.</li>\n<li>Influence the UX, in a collaborative fashion, for better flow of the app and app architecture.</li>\n<li>Evaluate and improve the processes for constant innovation, which impacts the various teams, including Android, backend, data science and product strategy.</li>\n<li>Benefit from a flat hierarchy and lean development methodologies.</li>\n</ul>\n<p><b>Requirements</b></p>\n<ul>\n<li>Significant experience building iOS applications (Objective-C, SWIFT)</li>\n<li>Who are excellent at problem-solving, able to adapt quickly and take initiative.</li>\n<li>Previous experience with modern mobile app architectures.</li>\n<li>A mindset to solve real-life consumer solutions.</li>\n<li>Passion to create a ‘5-star app’ on the App Store</li>\n<li>An understanding of the benefits of compartmentalizing code through design</li>\n<li>The confidence to challenge our tech and work in teams provide better solutions</li>\n</ul>\n<p>The role is based in our London office, 9am-5pm, five days a week.</p>\n<p>Salary Negotiable</p>\n<p>All Applicants must have the right to work in the UK</p>\n<p>Job Types: Full-time, Permanent</p>\n<p>Experience:</p>\n<ul><li>iOS: 3 years (Preferred)</li></ul>\n</div>\n"
    },
    {
      "title": "JavaScript Developer",
      "company": "Tradeweb Markets LLC",
      "location": "London",
      "salary": "",
      "summary": "You will be developing the UI for the next generation of Tradeweb’s trading platform, which is based on modern web technologies like HTML5 and Chromium....",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0CMUDaL693WNRk3nrnFOjU9lIdT9MBrzyndVEc7SiTvGdIj738vZRBDun4MgP549o6wzm4XqiRAHatmCm2hJbhhNGnjQ_YK51Iv0hAZ8PZrgAZJUHmJqyMpfNxrQgssSCP0PNl393ZJboajN3sAZxr0xQgeM0G6i94nSM2ch9DZh1vGNDmF9jaGYuxPCf8oxqm5jgkxBm_4JjmociZttY-xbC3uEEoEc5Fxr3rcy-RxlyKahlhMmi6CNbgegpYx4DTqux2T7M5-JH8qdrnxjClVaHMr5VQGX-YeNTfgCN63JbcLH7vDjGTiwQB54G2eNoVtiMA2y7fWAtRJ5WHR2xNPaMSfDXLWOp2SJ3S0gPKU07UxyYgSoYVdSUO4zq0Ie2FAAK2tIBHEskNV10MWMU9uU3ATBBxhuFOBpvFn0fv7Ww==&vjs=3&p=1&sk=&fvj=0",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div><div>You will be developing the UI for the next generation of Tradeweb’s trading platform, which is based on modern web technologies like HTML5 and Chromium. Passionate about software engineering, UX, single-page web applications, and the world of JavaScript, you will need to apply your existing expertise and develop it further to drive Tradeweb’s technology forward.</div><br><div>You will be responsible for delivering software end-to-end, from liaising with product managers and designers, to coordinating across international development teams on engineering and architecture, to working with our QA and dev ops teams - all ultimately to deliver a quality, innovative product to the traders and investors who depend on our platform every day.</div></div><br><div><b>Qualifications/Experience:</b><br><ul><li>Education: at least Bachelor's Degree, preferably in Computer Science</li></ul><ul><li>At least 3 years’ professional web application development experience</li></ul><ul><li>Expert-level JavaScript ES5 / ES6 / ES7 knowledge, and curiosity to learn more</li></ul><ul><li>Experience with or interest in using TypeScript</li></ul><ul><li>Experience with AngularJS and Angular 2/4/5/6 – the more in-depth your understanding, the better</li></ul>• HTML5, CSS3, SASS<ul><li>Superior analytical and problem solving ability</li></ul><ul><li>Broad knowledge of web platform and technologies</li></ul><ul><li>Robust understanding of performance issues, computational complexity, and code optimization.</li></ul><ul><li>Ability to apply expert knowledge of web platform and technologies to achieve business goals and solve new problems in a creative way.</li></ul><ul><li>Familiarity and implementation of industry-standard algorithms and design patterns</li></ul><ul><li>Proactive and team player who can deliver in a high pressure demanding environment</li></ul><ul><li>Interest in UX and UI design implementation</li></ul><br><br><br><b>About the Company:</b><div>Tradeweb Markets builds and operates many of the world’s most efficient financial marketplaces, providing market participants with greater transparency and efficiency in fixed income and derivatives. Focused on applying technology to enhance efficiency throughout the trade lifecycle, Tradeweb pioneered straight-through-processing in fixed income and now supports marketplaces for over 20 asset classes with electronic execution, processing, post-trade analysis and market data in an integrated workflow. Customers rely on Tradeweb to drive the evolution of fixed income and derivatives through flexible trading architecture and more efficient, transparent markets.</div><br><br>Tradeweb values diversity of culture and thought and seeks talented, qualified employees in all its operations around the world regardless of race, gender, national origin, religion, sexual orientation, disability, age or any other protected classification under country or local law.</div></div>"
    },
    {
      "title": "Oracle Apex Developer",
      "company": "Sky",
      "location": "London SW1A",
      "salary": "",
      "summary": "We're Sky, Europe's biggest entertainment brand. Think top-quality shows. Breaking news. Innovative tech. Must-have products. Careers here mean the freedom...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0C36Gf_gA6mIvXbLC_CGcBAee6d1qYBWNX2M8K5a2PWOT2oTUUCT48MXomPbSKuGS0pv5Qo6oOGrpw8U_sczVsJ70I8ERSqc3ev686MXVTsnkFVpSmtvlablbuLaS--qdChaVlaLi7-nG8LZpsAPtSxSY4QddnmucdmZBxqvbvXDL9aO8iAseRyXhj_kRAOewTGL2m8hyrysDQb-Sa7RivsuyOEBo4aaogfpGy6BP_NUI2m2IFFTga_qXRcchU9Ob7DYfC0YRfoLI4AMEvn91D0lqTAjdCIzf77YdNLqUn2ftN260p3XOAimJ-QbVtaPUwT07qdDYJtESIWuezwvYZ7-4qS9VQzv1PwC2jJvbGw_X5oJc2p22VwxEPPHaqDxAZ-h2hdXXR6d4RviNGZstXsebmEArdc4KNRJYuP0xgoWT2TEm8a3NQ7JYC60Nz8i5tpHP6jxa81WiYaYaEfh4gwQLhUxPpkHW_EbMMEL7KAc3c290BOzhbX&vjs=3&p=2&sk=&fvj=0",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item  icl-u-xs-mt--xs\">Permanent</div></div><div><p>We're Sky, Europe's biggest entertainment brand. Think top-quality shows. Breaking news. Innovative tech. Must-have products. Careers here mean the freedom and support you need to make an impact - pushing boundaries, creating solutions, hitting targets. And as part of our close-knit team, you'll enjoy plenty of benefits. Plus, experiences you'll only find at Sky.<br></p><br><p>This role is an exciting opportunity to join us and work within our Sky UKIS APEX Development Team<br></p><p><b>The Perks</b><br></p><p><br>Sky Q, a generous pension and private health care. Plus, access to over 12,000 LinkedIn Learning courses to support your development.<br></p><br><p>To find out more about working with us, search #LifeatSky on LinkedIn, Twitter or Instagram.<br></p><br><p><b>You will:<br></b></p><div><br><ul><li>Learn about different parts of Sky Technology Business and gain an understanding of the Sky Network Services data domain. Apply this knowledge to develop Oracle web based database applications.</li><li>Discuss requirements with business users and design Oracle database applications using relational database design, APEX software and Agile methods.</li><li>Develop in APEX to create new web-forms, incorporating SQL and PL/SQL code. Develop more complex functionality in Oracle PL/SQL. Write pre-defined reports in SQL. Enhance the APEX screens using JavaScript, JQuery and/or CSS.</li><li>Design new Relational Databases, including tables, foreign keys, indexes and triggers. Write SQL scripts to create database objects. Develop SQL Loader scripts to load historical data into Oracle database.</li><li>Support and enhance live APEX applications (currently 5).</li></ul><br><b>You'll have:</b></div><div><br><ul><li>Ability to work in a highly pressurised environment.</li><li>Excellent communication skills.</li><li>Excellent SQL skills.</li><li>Database skills with Oracle or similar (e.g. SQLServer/MySQL)</li><li>Able to co-ordinate development activities with other teams (including external teams) where dependencies exist. Ensure satisfaction levels are maintained in respect of quality and timing of deliverables.</li><li>Ability to communicate in a pragmatic and proactive way with other members of the team.</li><li>Take a logical and organised approach to problem solving identifying the root cause of problems and taking positive action to prevent reoccurrence.</li></ul><br></div><p>So, what are you waiting for? Apply now for a chance to forge your own career path and be brilliant as part of a bright, talented team.<br></p><br><p>Just so you know: if your application is successful, your appointment will be subject to receiving a positive outcome from your criminal record check.<br></p><br><p>We're happy to discuss flexible working.<br></p><br><p><i>It's our people that make Sky Europe's leading entertainment company. That's why we work hard to be an inclusive employer, so everyone at Sky can be their best.</i><br></p><p><i>If you are successful in your application for this role, your appointment will be subject to receiving a positive outcome from your Criminal Record Check.</i><br></p><p><i>A job you love to talk about</i></p></div></div>"
    },
    {
      "title": "Developer",
      "company": "Virtus Partners",
      "location": "London",
      "salary": "",
      "summary": "Able to assist other Developers as necessary. Developer required for a unique, highly configurable front office application providing credit analysis, order...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0A5xYOhj4pPEDfnbhTjC7M7fQaVOgP8QdhtfGw3GECDggWSVMjWwOQLApSjiCDrZFCsRvygZcyQOEHCJBptCHGvcTJRtuV92AWj3H4DP9xpjdjfZcGQgQPEcaZlQ2xXrXTSWAmGU27ddrKVj5kguWgo_GokwfDY1g2w9CUcxo0Wt7-2R4SduVdPXUm1Qhi7ezxGcJsQB8j60DYXmB-8A1EuNu2r9joP_MDQRyip-FGHJ0mYBdcj9QtgFX-A0YJulmwCnkQuOIZR9HEd8Mikrj0XnhDtH2WiALF0kYGadQrmDoGjNjC7OOh7og3JqtFLRarIilR0EglUBzyTdKO6-KoeKJeavped6cLcfnt-an4YALZQY13Qy1qC-TXvLlNsbmHkPBU1MFfAAQM6ptLib6jOOgiK7rJO6GW7CT_UVsFR2JeOK_ieOUYN6joGEgf_18MCqVup7lmeWyG6Vz50RgZFABxJSEQxVUWxqjcomBaREhtal4gL3Q0IYVavBv5h_iRxU5kzPaTd9mQX9t6-qdHDqCOXjCqNUqGFcN0TvoTIgVCG3col8GTWxL5jlgUUfotEth49rLYGIBjt-TfrNyVsP-BW9468u2TeOY7XdLxFr5BiPU5zrNN8SKgoLHeUKadv8EarUoX31ZiK89NEzKgzBAid3IejbP0=&vjs=3&p=3&sk=&fvj=0",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div>Developer required for a unique, highly configurable front office application providing credit analysis, order management, portfolio management and compliance modules across desktop, web and mobile platforms. Joining a small team of back and front-end developers to help improve the existing application and take ownership of implementing new features as part of the product roadmap. We are looking for someone who has experience in Finance, enjoys contributing ideas (both technical and product related) and who can mentor more junior developers where required.<ul><li>The development team owns the full software life-cycle of the project. The role therefore includes understanding requirements, interacting with clients directly, design/code/test/implement and production support of the platform.</li><li>Self-starter with ability to build working relationships and ability to work effectively in a fast-paced environment.</li><li>Willingness to take full ownership and drive projects and tasks to completion.</li><li>Review, discuss and work within agreed timescales and provide feedback to project managers as necessary.</li><li>Participate in continuous improvement activities by identifying and appropriately escalating process and product quality gaps, providing solutions when possible.</li><li>Other duties as assigned by Management.</li><br></ul><br>Required Skills<br><p><b>Special Skills and/or Abilities:</b></p><ul><li>Experience of Agile development processes including ability to work in Sprint based deliveries</li><li>Ability to build / troubleshoot / maintain an automated Dev Ops pipeline</li><li>Strong problem solving and logic skills.</li><li>Able to assist other Developers as necessary.</li><li>Able to evaluate and propose new technologies where appropriate</li><li>Strong verbal and written communication skills.</li><li>Excellent interpersonal skills and collaborative style.</li><br></ul><br>Required Experience<br><p><b>Education/Training (or equivalent):</b></p><ul><li>Bachelor’s Degree in Computer Science or equivalent preferred, but comparable work experience will be considered.</li><br></ul><br><p><b>Experience (Type of work experience, minimum number of years):</b></p><ul><li>Minimum of 5 years’ software development experience programming with the .NET framework, preferably C#.</li><li>Minimum 5 years’ experience with SQL (preferably PostgeSQL but any RDB will be considered)</li><li>Minimum of 2 years Capital Markets Financial product experience</li><li>Experience of Python a plus</li><li>Experience of F# a plus</li><li>Experience of AWS / Azure a plus</li><li>Collateralized Debt Obligations (CDOs) or fixed income/structured finance instruments, is a plus.</li></ul></div></div>"
    },
    {
      "title": "Business Intelligence Developer",
      "company": "Mimecast",
      "location": "London",
      "salary": "",
      "summary": "The Business Intelligence Developer will:. Developer with deep level subject matter expertise across the board, and proven ability to deliver on high priority...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0DfVJ4i74vC6hjtXAveDfy4EYCTTj9PoPbyskc7UEbU0Wh3sLZdg1Rqf3hZLF2RcIRwH7_uC846E_NlE9B7VKwMHQPDs7jvi9Tq3NXCknIed9j1HTYXjJ_OXz8uREQOPCy7AmcaEZAt_pQ424xCLZT6HubyrFP74Zpr0UsMNdlDuwmSrQFgS2vy6pI6yQLcEdqam45MBUTzbaSRC6Is0iWqaNELxsr1CJ2cXwLHv75tsIhpmjQPayhgAbjQRT2tfFTIloKSPzS4fmuaMY1kDVT5PC2MpYu_2Pw9_NyuvvMEDeDwg18XAc4Kq0yLx41JxQoUjm9xIMCi-d2d2A0jlCPPXATvURJUvOSsEmTBAEKDQDYyMRVuwmzawxoe4GB9al3dR0xXFDOMAw==&vjs=3&p=4&sk=&fvj=0",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div><b>ID </b>2018-3479<br><b>Job Location(s) </b>UK-London<br><b>Position Type </b>Permanent - Full Time<br><br><b>More information about this job:</b><br><b>Overview</b><br><br><b>About the role</b><br><br>We at Mimecast take the pain out of handling our clients' most important data: the information that passes through their email systems. Our solution is to cut through the complexity of corporate email. We built a platform from scratch that uses cloud computing to deliver email management. Everything we've done since, has been designed to take the pain out of information management and make the next generation of technology work better for our customers.<br><br><br><b>Our People</b><br><br>Our people are the very best. They have high levels of self-motivation which results in exceptional performance. We care deeply about our customers and take pride in delivering top class customer service.<br><br><br>We instinctively find practical solutions to complex problems, we take personal responsibility for our actions and embrace teamwork. At Mimecast we strive to win and celebrate our successes.<br><br><br><b>About the position</b><br><br>Mimecast are seeking an experienced B.I. Developer with deep level subject matter expertise across the board, and proven ability to deliver on high priority work items in a fast paced and changing business environment.<br><br><br>Outstanding technical skills should be paired with excellent communications skills as the role involves working closely with business partners in Finance, Operations, Sales and Marketing.<br><br><br>You will be working as part of a dynamic team, delivering best-in-class B.I. capabilities using the Microsoft B.I. stack. Our focus is primarily on delivering and supporting a scalable, performant and robust data warehouse that is utilised by our Analytics teams. As such the main skills focus is SQL Server, SSIS and SSAS.<br><br><b>Responsibilities</b><br><br><b>The Business Intelligence Developer will:</b><br><ul><li>Develop and support Business Intelligence solutions to agreed specifications and timescales.</li><li>Automate processes and develop efficiencies.</li><li>Cleanse, manipulate/transform and format large datasets to enable data quality improvements.</li><li>Troubleshoot production issues and provide solutions in a timely manner.</li><li>Support end to end maintenance requests on existing data sources .</li><li>Ensure data availability and uptime of the BI apparatus.</li><li>Be available to help in any area of the team where the successful person's skillset fits.</li></ul><br><br><br><b>Qualifications</b><br><br><ul><li>A minimum of 3 years' experience working with the Microsoft BI stack (SQL Server, SSIS and SSAS).</li><li>SQL Server 2012 or later.</li><li>Experience developing complex SQL queries, MDX, and stored procedures required.</li><li>Experience of query performance optimisation.</li><li>Experience of building Analysis Services cubes.</li><li>Understanding of dimensional modelling. Kimball preferred.</li><li>Strong problem solving, exceptional numeracy, analytical rigor and attention to detail.</li><li>Strong organisational skills.</li><li>A willingness to follow the teams' documentation procedures and contribute to creating and maintaining technical and support documents.</li><li>The ability to work in a fast-paced, rapidly evolving company environment.</li></ul><br><b>Reward</b><br><br>We offer a highly competitive rewards and benefits package including private healthcare, pension, life cover and an annual gym subsidization. Mimecast is an entrepreneurial and high growth company which will provide the right candidate with a wealth of career development opportunities. All Mimecasters strive on being high performers, problem solvers, team players with passion, integrity and effectiveness.<br><br><br>Mimecast is a global company with certain business operations in North America. By responding to this advertisement you are agreeing to your details, including any personally identifiable information therein, to be transferred to Mimecast North America, Inc. Mimecast North America, Inc will maintain adequate technical and organizational measure to protect your personally identifiable information and shall use it for the purposes of assessing suitability for this role. Should you wish to respond to this advertisement but do not consent to such transfer, please notify us in advance so that we are able to make alternative arrangements.<br><br><br>#LI-RT1<p>PI106040013</p></div></div>"
    },
    {
      "title": "C# Developer",
      "company": "Eurostop Ltd",
      "location": "London",
      "salary": "",
      "summary": "We are looking for a C# developer to join our application development team working across our range of products on all aspects (repository, middleware, front...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0AHMcY31bdtewPnOy2-_ijbWGRCwxFq1vZH53CXKBpC88uB5HhnH7q3BTgmPo96kezE1tGqbhyY6ExOVKkopUSnqirMQmw4uQ8miymVOE0_gOBGBJpEkcCJV2XFwRbmGxWEmLc89nUt2XUwUyGOy9jBJsntmLixRdpfZX1iSmRDrqOKQ0DIosXY-CNcClr-s2oHyOv_rajPKN6DIFzmUNEdnxsgTrLaiJZkURVyyrBApDXJDwo-xiK2VTXea43TVqBy6OxHcpfK_4qRJ0ZWaKps0nyAepmjqDWqG0nTxhbhtGy_ptMolT15D0KYIFZFfB-HIzELNSeEzaR0ZjMPa8UyymJtEJhlbwEI7TAaDvgvJItEPWWFlm2_s8tZGlGPM_eKhCbBaTDX1yUiioBDxnvDyi4nk1BgUN8Ns15z3tXpR9F2QtXmanXo&vjs=3&p=5&sk=&fvj=1",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><p><b>Job Summary</b></p><p><b>Who we are</b></p><p>We are a leading software house in the retail sector, providing solutions in Europe, USA and Asia. We commenced in the UK in 1990 specialising in the fashion and footwear market sector and have since expanded into Asia where we have some of the largest retail estates in the world.</p><p><b>The opportunity</b></p><p>We are looking for a C# developer to join our application development team working across our range of products on all aspects (repository, middleware, front-end). The opportunity involves all aspects of the development lifecycle including design, prototyping and research. There are many diverse aspects to be involved in including distributed systems architecture, high performance database design, front-end and mobile apps. The position involves a large amount of innovative, new code.</p><p>We are open to innovation and forward thinking approaches, and we value input into strategic, design and user experience matters from all team members. We favour continuous learning and are supportive of your ongoing training and professional development.</p><p><b>Job Type / Category</b></p><p>This is a full time role.</p><p><b>Required Education, Skills and Qualifications</b></p><p><b>Required skills</b></p><ul><li>C# / .NET</li><li>HTML5</li><li>NET MVC, WebAPI, HTML + CSS, Javascript, JQuery, TypeScript</li><li>Angular</li><li>MS SQL Server</li><li>Good communication skills</li></ul><p><b>Desirable skills</b></p><ul><li>Experience of DDD / IOC</li><li>Experience of .NET multithreaded apps</li><li>Experience of writing efficient code</li><li>Experience of working with Azure</li><li>Experience using .NET core</li><li>Experience with high-volumne production systems</li></ul><p>Job Type: Full-time</p></div>"
    },
    {
      "title": "Junior database developer (entry level)",
      "company": "CoderList",
      "location": "London",
      "salary": "£24,000 - £28,000 a year",
      "summary": "You will work closely alongside Data Architect and Senior Database Developers and operations and management team....",
      "link": "https://www.indeed.co.uk/company/CoderList/jobs/Junior-Database-Developer-ac3db2cb4003214d?fccid=80877499a43578a8&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item \">£24,000 - £28,000 a year</div></div><p>This is a great opportunity to work with an exciting Saas start up in London building data management and client relationship software for sports clubs around the world.</p><p>This is an entry-level position and no previous commercial experience is required.</p><p><b>About you: </b></p><ul><li>Excellent communication and interpersonal abilities</li><li>Good problem-solving and analytical skills</li><li>Ability to work independently and as part of a team</li><li>Any interest in sport would be a bonus but not essential</li></ul><p><b>The role: </b></p><p>You will work closely alongside Data Architect and Senior Database Developers and operations and management team. You will demonstrate a high degree of independence, responsibility and professionalism, and be fluent in written and spoken English.</p><p><b>Relevant skills: </b></p><ul><li>MS SQL Server</li><li>C#</li><li>Microsoft .NET framework 4.0 +</li></ul><p>We are particularly keen to hear from individuals with a natural enthusiasm for tech that will help us develop our existing products. This could be knowledge gained through employment or from a personal interest perspective.</p><p><b>How to apply: </b></p><p>To apply for this role, you should visit http://bit.ly/2SKNqEI to create an account and fill out a profile which will then be used as your application.</p><p>Job Type: Full-time</p><p>Salary: £24,000.00 to £28,000.00 /year</p></div>"
    },
    {
      "title": "Food Product Developer",
      "company": "Marks & Spencer",
      "location": "London",
      "salary": "£19,500 a year",
      "summary": "Food Product Development KEY INFORMATION Location: Head Office (London) Duration: 12 months Salary: £19,500, pro rata About the programme At M&S, we’re...",
      "link": "https://www.indeed.co.uk/rc/clk?jk=f8a893ede71fa4ef&fccid=ae3ed1b6cbd83168&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item \">£19,500 a year</div></div><div><div><b>Food Product Development</b><br><p><b>KEY INFORMATION</b></p><br><p><b>Location:</b> Head Office (London)</p><br><p><b>Duration:</b> 12 months</p><br><p><b>Salary:</b> £19,500, pro rata</p><br><p><b>About the programme</b></p><br><p>At M&amp;S, we’re known for the quality, innovation and creativity of our food. So as someone who’s studying for a food-related qualification (can we tailor to reflect the subjects quoted in the killer questions), what could be better than helping us to make it even better?</p><br><p>This placement will see you work with some of the food industry’s brightest minds, helping to improve on our existing recipes, while developing delicious new ideas to inspire the millions of customers who shop with us every week. This will involve spending time in our stores to see the impact of what we create, and working with our network of suppliers to discover how we build the delicious combinations offered in-store. And after your six-month placement with us is finished, we’ll even help you secure a further six-month placement with one of our suppliers – ensuring you get a full and rounded view of the industry.</p><br><p>In this vital and highly creative part of our business, we’re looking for you to bring your fresh thinking and genuine passion for food. In return, you’ll be transformed in a real professional with excellent career prospects. What could be more satisfying than working with people to create the most amazing food experiences?</p><br><p>Click below to apply.</p></div></div></div>"
    },
    {
      "title": "Junior Web Developer (no experience)",
      "company": "CoderList",
      "location": "London",
      "salary": "£22,000 - £30,000 a year",
      "summary": "We are working with a great London based company in the digital publishing space looking to rapidly grow their junior developer programme....",
      "link": "https://www.indeed.co.uk/company/CoderList/jobs/Junior-Web-Developer-3ddc29d4c08e61aa?fccid=80877499a43578a8&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item \">£22,000 - £30,000 a year</div></div><p><b>Intro</b></p><p>At CoderList our sole focus is to help talented <b>junior</b>developers secure their <b>very first job</b>in tech.</p><p>We are working with a great London based company in the digital publishing space looking to rapidly grow their junior developer programme. The company are seeking front-end, back-end, and full-stack junior developers to join the team in the London office.</p><p>All positions are entry-level, and no previous commercial experience is required.</p><p>Application instructions at the bottom of the page.</p><p><b>The role</b></p><p>Successful candidates will be working as entry-level developers in a collaborative team on all stages of development, from conception through to delivery and maintenance. Working underneath the development manager, they will be responsible for supporting multiple projects, including existing infrastructure and new solutions. Successful applicants will also work closely with ticketing systems, helping to deal with technical support issues as they arise.</p><p><b>Requirements &amp; Skills</b></p><p>We are more concerned with passion and potential than with what specific technologies you know, and further training and mentoring will be provided during the role.</p><p>However, for this position you should:</p><ul><li>Have a passion for technology</li><li>Be able to work and learn independently</li><li>Be a creative thinker able to find innovative solutions</li><li>Be a great communicator able to clearly discuss your work with others</li><li>Be able to manage your own workload</li><li>Be proficient in working to agreed KPIs</li></ul><p>In addition to this, you should have a decent grounding in the relevant web technologies for the role you are interested in. For example, HTML, CSS and JavaScript if you are interested in front-end positions, and at least one back-end language and database (e.g. PHP, Ruby, Python, C# + PostgreSQL, MySQL) for full-stack or back-end roles. You do not, however, need to be an expert, and we look for potential rather than mastery.</p><p><b>Applying</b></p><p>To match with this role and others, you should visit http://bit.ly/2QiJyNH to create an account and fill out a profile which will then be used to match you with positions.</p><p>Job Type: Full-time</p><p>Salary: £22,000.00 to £30,000.00 /year</p></div>"
    },
    {
      "title": "Junior Front-End Developer",
      "company": "Camelot Global",
      "location": "London",
      "salary": "",
      "summary": "At least 2+ years working full time as a front-end/javascript developer. We are looking for a brilliant Javascript/Front-end Developer to come and join us at...",
      "link": "https://www.indeed.co.uk/rc/clk?jk=c4ab8837c28ffafb&fccid=fb98efcf71fa1fec&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div><p>Here at Camelot Lottery Solutions we have a real ambition to develop the best tools and platforms within the global lottery industry. We are looking for a brilliant Javascript/Front-end Developer to come and join us at our global HQ in central London and be part of an exciting journey where we will not only utilise your front-end skills but we will also put you on a track of developing your skills in other niche areas to help support our customers and other teams internally in building a real time Big Data platform that supports reporting, analytics, and powers a best in class digital marketing stack.</p><p><b>A bit about what you’ll be doing with us:</b></p><p>As part of our Global BI and CRM product unit. The team’s objective is to build a full omni channel analytics and CRM capability supporting both greenfield and complex integrations to existing legacy architectures for Lottery customers. We help develop areas of our marketing stack that our customers use to optimise and influence user journeys. build a consistent and timely omni-channel strategy, and get a better understanding of users behaviours and campaign attribution by capturing digital data and funnelling it to web analytics solutions and the big data platform.<br></p><p><b>Requirements</b></p><p><b>What skills we need to see from you:</b></p><ul><li>At least 2+ years working full time as a front-end/javascript developer</li><li>The desire to learn and develop your skills to the next level</li><li>Experience in responsive design</li><li>Experience of working with vanilla Javascript</li><li>Experience manipulating the DOM</li><li>Basic knowledge of various Web API’s and how to integrate with 3rd party systems</li></ul></div></div>"
    },
    {
      "title": "Software Developer",
      "company": "G-Research",
      "location": "London WC1E",
      "salary": "£75,000 - £130,000 a year",
      "summary": "You will be an intelligent, capable and hands-on developer who has an excellent academic background. We are looking for the world’s foremost developers and take...",
      "link": "https://www.indeed.co.uk/company/AMS/jobs/Software-Developer-8a4ce755a947c50b?fccid=0289bc495991c482&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item \">£75,000 - £130,000 a year</div></div><p><b>Imagine writing the code at the core of your company’s success </b></p><p>G-Research is a leading quantitative research and technology company. By using the latest scientific techniques, we produce world-beating predictive research and build advanced technology to analyse the world’s data.</p><p>Software Engineering is core to our business. By designing and implementing real-time systems, our engineers are solving some of the world’s most complex financial problems.</p><p><b>The Role</b></p><p>We are looking for the world’s foremost developers and take recruitment of the best talent very seriously. Most of our systems are written in C# but we also have specialist teams using C++, Java and F#. We also utilise modern web, distributed and big data technologies, so we have a broad range of software development challenges for the right person.</p><p>This is an opportunity to be part of our journey to build a world-leading software development practice. We are working hard to embed a Continuous Improvement culture &amp; philosophy across the organisation and are striving to learn from the best practitioners in the industry.</p><p><b>Who are we looking for?</b></p><p>The ideal candidate will at minimum have experience in the following areas:</p><ul><li>You will be an intelligent, capable and hands-on developer who has an excellent academic background</li><li>Have a genuine interest in both software technology &amp; the underlying hardware.</li><li>You will demonstrate a proven ability to develop high-quality software in an OO language</li><li>Have an appreciation of good software architecture, CompSci fundamentals &amp; data structures</li><li>Working knowledge of Agile, Continuous Delivery and TDD principles.</li></ul><p><b>Why should you apply?</b></p><ul><li>Highly competitive compensation plus annual discretionary bonus</li><li>Informal dress code and excellent work/life balance</li><li>Comprehensive healthcare and life assurance</li><li>25 days holiday</li><li>Contributory pension scheme</li><li>Cycle-to-work scheme</li><li>Subsidised gym membership</li><li>Monthly company events</li><li>Central London office close to 5 stations and 6 tube lines</li></ul><p>Opening Date 12/12/18</p><p>Closing Date 09/01/19</p><p>Job Type: Full-time</p><p>Salary: £75,000.00 to £130,000.00 /year</p><p>Experience:</p><ul><li>software development: 1 year (Required)</li></ul></div>"
    },
    {
      "title": "Food Product Developer",
      "company": "Harrods Limited",
      "location": "London SW1X",
      "salary": "",
      "summary": "Developer to join our talented team. Searching for a delectable career opportunity?...",
      "link": "https://www.indeed.co.uk/rc/clk?jk=f7daecbff00515d5&fccid=a215cb2b2520e59a&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><b>Job Description:</b><br>Searching for a delectable career opportunity?<br>We need an experienced and imaginative Food Product<br>Developer to join our talented team.<br>Keeping an eagle eye on the market, you’ll identify<br>emerging trends and envision innovative and<br>palate-pleasing products.<br>Working with the Buying team, it will be up to you to<br>devise an appropriate Own Label Strategy for each<br>category, ensuring it aligns with the overall business<br>strategy.<br>You will need the pragmatic nature to gauge whether a<br>concept is commercial, as well as the project management<br>experience to meet tight deadlines while balancing<br>multiple responsibilities.<br>With your proactive and hands-on approach, you’ll liaise<br>with chefs and suppliers, coordinating tastings to<br>ensure requirements are understood and the finished<br>product meets our impeccable standards.<br>Using your exceptional communication skills, you’ll work<br>with teams across the business, and build strong<br>relationships with a wide variety of vendors. You’ll<br>have the resilience and self-assurance to advise and<br>persuade when necessary.<br>To be successful, you must have an impressive background<br>in Food Product Development. You will have a true<br>passion for food, combined with an unbeatable<br>understanding of the luxury customer. Packaging design<br>experience would be highly beneficial, but is not<br>essential.<br>If you would savour this role, apply now.</div>"
    },
    {
      "title": "Business Developer to develop opportunities and close deals",
      "company": "Orsted Germany",
      "location": "London",
      "salary": "",
      "summary": "Business Developer to develop opportunities and close deals. Are you an experienced business developer who wants to lead the sale of our Route-to-Market...",
      "link": "https://www.indeed.co.uk/rc/clk?jk=877931b44673fc3b&fccid=70d5901ea9f06e45&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div><div><b>Business Developer to develop opportunities and close deals</b></div><div><i>Are you an experienced business developer who wants to lead the sale of our Route-to-Market Services?</i></div><br><div>Join us as a Business Developer in our growing Power Origination team where you’ll be developing new business opportunities and closing deals in the UK for the sale and purchase of power. The Power Origination team develops innovative ways to manage risk and create value from our company’s power portfolio.</div><br><div><b>Your key tasks will be to</b></div><ul><li>lead the selling of route-to-market services and risk management products</li><li>build and maintain strong relationships with counterparts</li><li>coordinate tender responses and participate in contract negotiations</li><li>qualify opportunities and attend meetings to support origination deals</li><li>work closely with the team to identify opportunities for new products and services.</li></ul><br><div>Furthermore, you maintain good working relationships with internal stakeholders.</div><br><div><b>Your competences include that you</b></div><ul><li>have a proven ability to identify, negotiate and close new business</li><li>demonstrate a good understanding of the UK energy market</li><li>have the ability to work independently and as part of a team</li><li>are proactive and analytical in your approach to work tasks</li><li>are an excellent communicator and presenter.</li></ul><br><div>Moreover, you’re are educated to degree level or higher and you speak and write English fluently. Most important of all is that you’re a self-starter, enjoy a fast-paced work environment and the satisfaction of closing deals.</div><br><div><b>Working at Ørsted</b></div><div>To be the frontrunner in the green energy transformation, we invest significantly in innovation and empower our employees to help shape the renewable energy technologies of the future. We cultivate a collaborative, dynamic and diverse work environment and encourage career-long learning and development so our people can realise their full potential.</div><br><div><b>Would you like to help shape the renewable technologies of the future?</b></div><div>Send your application to us as soon as possible and no later than 18 January 2019, as we’ll be conducting interviews on a continuous basis.</div><br><div>All UK-based positions will be subject to satisfactory pre-employment screening, further details will be given at offer stage</div><br><div>Please note that for your application to be reviewed, you must submit your application via our online career pages.</div><br><div>You should expect travelling both in the UK and Europe in relation to your work.</div><br><div><b>About Ørsted</b></div><div>Headquartered in Denmark, Ørsted’s 6,000 employees develop, construct and operate offshore wind farms, bioenergy plants and innovative waste-to-energy solutions and provide smart energy products to its customers. Ørsted Customer Solutions’ 500 employees deliver state-of-the-art smart energy solutions and handle all aspects related to purchasing, selling and distributing energy. For more information on Ørsted, visit orsted.com.</div></div></div>"
    },
    {
      "title": "Business Developer to develop opportunities and close deals",
      "company": "Orsted",
      "location": "London",
      "salary": "",
      "summary": "Business Developer to develop opportunities and close deals. Are you an experienced business developer who wants to lead the sale of our Route-to-Market...",
      "link": "https://www.indeed.co.uk/rc/clk?jk=bda99feddb7a7fc8&fccid=d4f90cc00660642a&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div><div><div><div><b>Business Developer to develop opportunities and close deals</b></div><div><i>Are you an experienced business developer who wants to lead the sale of our Route-to-Market Services?</i></div><br><div>Join us as a Business Developer in our growing Power Origination team where you’ll be developing new business opportunities and closing deals in the UK for the sale and purchase of power. The Power Origination team develops innovative ways to manage risk and create value from our company’s power portfolio.</div><br><div><b>Your key tasks will be to</b></div><ul><li>lead the selling of route-to-market services and risk management products</li><li>build and maintain strong relationships with counterparts</li><li>coordinate tender responses and participate in contract negotiations</li><li>qualify opportunities and attend meetings to support origination deals</li><li>work closely with the team to identify opportunities for new products and services.</li></ul><br><div>Furthermore, you maintain good working relationships with internal stakeholders.</div><br><div><b>Your competences include that you</b></div><ul><li>have a proven ability to identify, negotiate and close new business</li><li>demonstrate a good understanding of the UK energy market</li><li>have the ability to work independently and as part of a team</li><li>are proactive and analytical in your approach to work tasks</li><li>are an excellent communicator and presenter.</li></ul><br><div>Moreover, you’re are educated to degree level or higher and you speak and write English fluently. Most important of all is that you’re a self-starter, enjoy a fast-paced work environment and the satisfaction of closing deals.</div><br><div><b>Working at Ørsted</b></div><div>To be the frontrunner in the green energy transformation, we invest significantly in innovation and empower our employees to help shape the renewable energy technologies of the future. We cultivate a collaborative, dynamic and diverse work environment and encourage career-long learning and development so our people can realise their full potential.</div><br><div><b>Would you like to help shape the renewable technologies of the future?</b></div><div>Send your application to us as soon as possible and no later than 18 January 2019, as we’ll be conducting interviews on a continuous basis.</div><br><div>All UK-based positions will be subject to satisfactory pre-employment screening, further details will be given at offer stage</div><br><div>Please note that for your application to be reviewed, you must submit your application via our online career pages.</div><br><div>You should expect travelling both in the UK and Europe in relation to your work.</div><br><div><b>About Ørsted</b></div><div>Headquartered in Denmark, Ørsted’s 6,000 employees develop, construct and operate offshore wind farms, bioenergy plants and innovative waste-to-energy solutions and provide smart energy products to its customers. Ørsted Customer Solutions’ 500 employees deliver state-of-the-art smart energy solutions and handle all aspects related to purchasing, selling and distributing energy. For more information on Ørsted, visit orsted.com.</div></div></div></div></div>"
    },
    {
      "title": "Appian Developer – London",
      "company": "Capgemini",
      "location": "London",
      "salary": "",
      "summary": "We are looking to recruit an Appian Developer across the Digital practice based in London. The focus of your role....",
      "link": "https://www.indeed.co.uk/rc/clk?jk=92b351c6f2b5d170&fccid=105ecfd0283f415f&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item  icl-u-xs-mt--xs\">Permanent</div></div><div><div><div><div><p><b>The focus of your role</b></p><br><p>We are looking to recruit an Appian Developer across the Digital practice based in London. This is a permanent position and represents a unique opportunity for someone to enhance their digital consulting career.</p><br><br><br><br><p><b>What you’ll do</b></p><ul><li>Experience in consulting methodologies such as process mapping, requirements gathering and running workshops</li><li>Experience in agile methodologies building solutions in cross-functional teams</li><li>Experience in designing the Appian solution architecture, process discovery and gap analysis.</li><li>Work with clients throughout the entire life-cycle of projects to scope, define, design, and implement solutions</li><li>Design and implement solutions with Appian software and provide demonstrations and proof of concepts</li><li>Supervise, mentor and develop resources on implementation best practices both onsite and offshore</li><li>Identifying, managing and mitigating risks and issues throughout the delivery lifecycle</li></ul><br><br><br><p><b>What you’ll bring</b></p><ul><li>Experienced in designing and implementing Appian 18.x solutions</li><li>Knowledge of Appian architecture and its objects &amp; best practices</li><li>Good understanding of database concepts and strong working knowledge any one of the major databases e.g. Oracle, SQL Server &amp; MySQL</li><li>Experience of integrations using web services (e.g. XML, REST, WSDL, SOAP), API, JDBC, JMS</li><li>Understanding on how to implement LDAP, SAML configuration</li><li>Appian administration</li></ul><br><br><br><p><b>About Capgemini</b></p><br><p>With more than 190,000 people, Capgemini is present in over 40 countries and celebrates its 50th Anniversary year in 2017. A global leader in consulting, technology and outsourcing services, the Group reported 2016 global revenues of EUR 12.5 billion. Together with its clients, Capgemini creates and delivers business, technology and digital solutions that fit their needs, enabling them to achieve innovation and competitiveness. A deeply multicultural organisation, Capgemini has developed its own way of working, the Collaborative Business ExperienceTM, and draws on Rightshore®, its worldwide delivery model.</p><p>Learn more about us at www.capgemini.com</p><p>Rightshore® is a trademark belonging to Capgemini</p><br><br><br><p><b>What we’ll offer you</b></p><br><p>Professional development. Accelerated career progression. An environment that encourages entrepreneurial spirit. It’s all on offer at Capgemini. And although collaboration is at the core of the way we work, we also recognise individual needs with a flexible benefits package you can tailor to suit you</p><br><br><br><p><b>Why we’re different</b></p><br><p>At Capgemini, we help organisations across the world become more agile, more competitive and more successful. Smart, tailored, often-groundbreaking technical solutions to complex problems are the norm. But so, too, is a culture that’s as collaborative as it is forward thinking. Working closely with each other, and with our clients, we get under the skin of businesses and to the heart of their goals. You will too.</p><p>Capgemini positively encourages applications from suitably qualified and eligible candidates regardless of sex, race, disability, age, sexual orientation, gender reassignment, religion or belief, marital status, or pregnancy and maternity. We are committed to hiring, developing and retaining the best people to deliver innovative, world-class solutions for our clients. We foster an inclusive culture that enables everyone to achieve their full potential and enjoy a fulfilling career with us. Our comprehensive flexible benefits package and lifestyle policies enable our employees to balance their individual, family and work-life needs.</p></div></div></div></div></div>"
    },
    {
      "title": "Junior Software Developer",
      "company": "Merkle Periscopix",
      "location": "London SE1",
      "salary": "",
      "summary": "Life as a Junior Software Developer. Work with developers to plan project pipelines and work distribution....",
      "link": "https://www.indeed.co.uk/rc/clk?jk=0b8d5fb1ff41b88a&fccid=4af320ba68a6c707&vjs=3",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div>Job Description<br><br><p><b>Life as a Junior Software Developer</b></p><p>As our junior developer you will receive on the job training, work with cutting edge technology and be given the freedom to learn independently and work autonomously while still being part of a supportive and collaborative basis.</p><p>Role Objectives</p><ul><li>Successfully deliver technical solutions that support the wider business.</li><li>Efficiently work to build internal tools on time and to scope.</li><li>Maintain internal coding best practices.</li></ul><p>Key Relationships</p><ul><li>Work with developers to plan project pipelines and work distribution.</li><li>Engagement with stakeholders on a project-by-project basis.</li></ul><p>Responsibilities</p><ul><li>Design and build solutions using a variety of frameworks and languages, with a focus on React and .Net Core.</li><li>Improve development capabilities through upskilling, training and on-the-job experience with an aim to become particularly adept in JavaScript (ES6), React and C#.</li><li>Receive project briefs and plan an appropriate solution with support from other developers.</li><li>Optimise, troubleshoot and maintain tools and solutions.</li><li>Present solutions back to key stakeholder within the agency, soliciting feedback and the need for any follow ups.</li></ul></div><br><div>Qualifications<br><br><p>We will offer full on the job training, however, the following skills would be required:</p><ul><li>Demonstrable skills and knowledge in at least JavaScript or C#</li><li>Ability to design and write reliable, maintainable code.</li><li>Strong problem-solving skills</li><li>Clear, accurate and concise written and verbal communication</li><li>Comfortable working in a fast and agile environment</li><li>Understand concepts of Object Orientated Programming (this can be self-taught or part of a module at university)</li></ul><br>Additional Information<br><br><p>As we progress and develop as a company, you will too. Within our fast-growing company, there’s plenty of opportunity to develop your skill set and you’ll be encouraged to be curious and share new ideas. In exchange for your contribution to our award-winning company, we make sure you take advantage of a generous holiday allowance and are paid a competitive salary. We’re really proud of our company values and culture; we have regular company / team socials and want all our employees to enjoy coming into work.</p><p>Some of our benefits include:</p><ul><li>Friendly, approachable office atmosphere - and business-casual dress code</li><li>Free breakfast (toast, spreads, fresh fruit, coffee, tea)</li><li>Regular company socials (including bowling, Crystal Maze, quiz nights, annual Christmas and Summer parties to name a few!)</li><li>On-site Games Room with ping pong and pool table</li><li>The company pays for our lunch on the last Friday of every month</li><li>On Friday’s at 4:30pm (Four Thirsty) everyone can help themselves to a celebratory drink</li><li>Cycle2Work scheme, free eye tests, a company mobile phone and season ticket loans (post 3-month probation)</li></ul><p><i>At the point of application, the candidate must have the legal right to work in the UK as we are unable to sponsor visas as this time.</i></p><p><i>Merkle does not discriminate against job applicants on the basis of age, disability, gender reassignment, marital or civil partner status, pregnancy or maternity, race, colour, nationality, ethnic or national origin, religion or belief, sex or sexual orientation. Experience stipulated in this job description serves as a guide only and all applications will be considered on their merits, irrespective of experience.</i></p><p><i>As part of our Diversity and Inclusion agenda, and as an Equal Opportunities employer, if you require reasonable adjustments during the selection process please engage directly with your Recruiter.</i></p></div></div>"
    },
    {
      "title": "Software Developer",
      "company": "AWAX",
      "location": "London",
      "salary": "£45,000 - £50,000 a year",
      "summary": "Experience hiring of technical resources, including developers & testers. Ensure all software developed is of a robust and high-quality nature meeting the...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0AglJ-dploO7XRgbJEguDg-riHeGz3mUWjG98y9lAE2kwl34e9pZEkkfXg_Rjti5yMUfArVAQZp2iv6xHknW_UpEmAVfPzd6BNvRVXbvidqAMLCOy81YvGaxPlwLjF4khbMMeQxB2-Yr2nKKHARwjuQi6OdXtiZP7pvq7hoiznIlY0errxULDRfVzuk4D0w7qJ6pjiBtbLglibmeBk3yR5ecVOsLOZNgLXidJRwgRJUAHD_uZ8R6vhGoreg09XX_aTCA-e6-3jH3CCq2fxxRHl1VqY7OKW-mV8ntIWIj_zjZSGOlZi7LOqjMpLPKrio8DACN_gMzIDqoyJQqaYDyBE79lmTOrvyhsRKHckRv_D059ybVhPH95CNSxjLqWsgLYW_IDCH9uGIdpzrRv3w-eNG29UFlK_xKw4q2LMxeePnvDMXxj30vn4C&vjs=3&p=6&sk=&fvj=1",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item \">£45,000 - £50,000 a year</div></div><p><b>Responsibilities: </b></p><ul><li>Ensure all software developed is of a robust and high-quality nature meeting the requirements of the agreed specifications and complying with Unminds formal and informal development team standards and procedures</li><li>Build reusable, extensible code that is easily worked on by other team members</li><li>Ship both large and small features independently</li><li>Investigate and implement bug fixes and performance improvements</li><li>Ability working across multiple application and technology domains</li></ul><p><b>The following experience is required: </b></p><ul><li>Significant experience with bespoke built applications on a Microsoft desktop platform</li><li>Expert knowledge of C# / .Net applications development</li><li>.Net Frameworks</li><li>WPF, MFC, XML, JSON, GDI, WINDOWS API, DLL</li><li>CI/CD, Jenkins, GIT</li><li>Experience applying automating testing frameworks enabling TDD &amp; BDD</li><li>Experience implementing Agile Methodologies and tools</li><li>Experience hiring of technical resources, including developers &amp; testers</li><li><b>Immediate Start </b></li></ul><p>Job Type: Full-time</p><p>Salary: £45,000.00 to £50,000.00 /year</p><p>Experience:</p><ul><li>software development: 4 years (Required)</li></ul></div>"
    },
    {
      "title": "Blockchain Developer",
      "company": "AWAX",
      "location": "London",
      "salary": "",
      "summary": "As a Blockchain Developer you’ll be responsible for:. As blockchain developer you will be responsible for designing, implementing, and supporting a DApp on a...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0AglJ-dploO7XRgbJEguDg-riHeGz3mUWjG98y9lAE2kwl34e9pZEkkkIRJ_TW-DWvx9YARcr7IFJNTfiob5AxwyJRhT8BOoVPDi0Fah6xrPYAV2KkN3u3rhOEVtWCWk008S6bNS_nEV1EVZgy-21I-7tX89A1d50ZE_1hdwcZSKe_QQZKq4o7oAkw8WjSHmTWXF-nWZP8sksnlaJMNOcM7-RI5MBi3zL7FwrhB5HJEvLESmL2jVBggUeEFXo27Wwvi5QH0SQWjT9QZZvw06nD12oxD5EVSJh8eP_s0gRFISe1CIKSs7zsv8hTOPRncHELDHacX6koWWX-2uQDURE6qxRJW60dyb9AbFErMzTyue1Hh6vjUAlCKHWVlfHTwYY4Th0BfMUl7rQTW4DYCGr1l9LKfm1lVhDkC_xt3RXcQ6zKa-7R93gR49xEN6k5LC4I=&vjs=3&p=7&sk=&fvj=1",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item  icl-u-xs-mt--xs\">Permanent</div></div><p><b>Job Description</b><br>As blockchain developer you will be responsible for designing, implementing, and supporting a DApp on a blockchain network. Your primary responsibility will be analyzing requirements, designing and implementing critical sections of the<br>blockchain storage, architecture and infrastructure, designing and developing the smart contract ecosystem and solving industry challenges with the use of blockchain technology.</p><p><b>Job Type / Category</b></p><p>As a Blockchain Developer you’ll be responsible for:</p><ul><li>Research, design, develop, and test blockchain technologies</li><li>Brainstorm and help evaluate applications for new tools and technologies as they continually evolve</li><li>Maintain and extend current client- and server-side applications responsible for integration and business logic</li><li>Be involved in the global blockchain community—work on implementing and integrating the latest improvement proposals</li><li>Document new solutions as well as maintaining that of existing ones</li></ul><p><b>Required Education, Skills and Qualifications</b></p><p>The ideal candidate for the role will possess:</p><ul><li>Strong software development background</li><li>Experience working with Ethereum, Solidity and smart contracts in your spare time or in production</li><li>Knowledge of Nervos, DFINITY and NEO</li><li>Production experience working with the latest standards ES6ES7, server side NodeJS and experience client side with frameworks such as ReactJS, VueJS and Python</li><li>Experience working with large codebases</li><li>Experience working with open-source projects</li><li>Strong knowledge of common algorithms and data structures</li><li>Familiarity with basic cryptography</li><li>Familiarity with P2P networks</li><li>Strong knowledge of concurrency and writing efficient and safe multithreaded code</li><li>Strong knowledge of STL, C++11</li><li>Proficiency in the QT Widgets module</li><li>Problem solver mentality - an ability to break down problems which might not have been solved in industry.</li><li>Capacity to work under pressure and to deadlines</li><li>Confidentiality is essential</li><li>Flexibility and be open to change</li><li>Initiative, self-motivated</li><li>Work co-operatively with others as part of a team</li></ul><p><b>Immediate Start </b></p><p>Job Types: Full-time, Permanent</p><p>Experience:</p><ul><li>javascript: 3 years (Required)</li><li>development: 3 years (Required)</li></ul></div>"
    },
    {
      "title": "NetSuite Developer",
      "company": "Mimecast",
      "location": "London",
      "salary": "",
      "summary": "The NetSuite Developer works in conjunction with the project architects and the broader business team to build NetSuite-based solutions to meet the business...",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0DfVJ4i74vC6hjtXAveDfy4EYCTTj9PoPbyskc7UEbU0Wh3sLZdg1Rqf3hZLF2RcIQH6a6NynM4b_CfwteuMc1tNakFgXS1aBlrNENU_GtvueG9uoKxcUNHDPB5zz-ozc2frpEUmtC5Aven906VUlxmmxDsxOqCnQrnf-tUMgNqNf4gQWLvgVWsnJpI23DBQAjZMhjhH2OPjn4r09flmY0a_U9IepLoBgS2cZ_0v0Rhu57m3Dya7lSdZY52PnV69QC5pkW_664SST7vR2K3YTU6Z4BVLmA3owa1o6YIbLwNTNkVjpthraL9hAOvgSyzrY6C-nYJT66la7DInh83Oq3szp6McVoEUaDnMJzNcNTZZ4nmFwNWr3bUBZa3obNbcqKIZgTWmJvenw==&vjs=3&p=8&sk=&fvj=0",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div><b>ID </b>2018-3045<br><b>Job Location(s) </b>UK-London<br><b>Position Type </b>Permanent - Full Time<br><br><b>More information about this job:</b><br><b>Overview</b><br><br>The NetSuite Developer works in conjunction with the project architects and the broader business team to build NetSuite-based solutions to meet the business needs. Depending on the nature of the project, this role will be required to configure the solution within the NetSuite platform and/or perform custom development and may be called on to assist with activities like scoping and documentation.<br><br><b>Responsibilities</b><br><br><ul><li>Work closely with Business Analysts to translate business requirements into wellarchitected solutions that best leverage the NetSuite product</li><li>Develop, test, document and maintain out of the box and / or custom solutions, integrations, and data migration elements of a NetSuite implementation</li><li>Participate in technical design sessions; develop technical solution documentation aligned with the business objectives</li><li>Execute test plans to ensure quality delivery</li><li>Follow coding standards and participate in code reviews during projects to ensure appropriate design patterns are followed</li><li>Provide estimates and work breakdown structures for assigned tasks</li><li>Absorb technical capabilities from NetSuite during new product releases and acquisitions</li><li>Create innovative ways to integrate with other business systems</li></ul><br><br><br><b>Qualifications</b><br><br><ul><li>5+ years of progressively responsible experience in a Business Systems role, providing hands-on recommendations for process and systems improvement, while undertaking various development projects</li><li>Proven ability to develop and optimize integrated business processes across disparate systems</li><li>3+ years' experience being a key stakeholder in a NetSuite (or ERP tool) implementation</li><li>2+ years of developing, configuring, and supporting the NetSuite product</li><li>Extensive development experience using SuiteScript, building Suitelets, RESTlets, User Events, Scheduled scrips, building reports and APIs to respond to technical and non-technical users</li><li>Ability to perform automated testing and write unit tests</li><li>Experience with full lifecycle development</li><li>Familiarity with agile software delivery methodologies and tools such as Scrum, Jira, Rally or Agile Accelerator</li><li>Excellent written and oral communications skills</li><li>Active NetSuite certifications or ability to achieve relevant certifications upon hire</li><li>Requirements, design, testing, documentation, implementation, and support</li><li>Advocate of best practices, design principles and development methodologies</li><li>A highly-accomplished communicator, both in senior management settings as well on a one to one basis</li><li>Ability to articulate process changes and improvements up and down the organization</li><li>At ease in leveraging virtual resources and teaming to drive projects to on time completion</li><li>Collaborative team player with excellent interpersonal skills</li></ul><br><br><br><b>Reward</b><br><br>We offer a highly competitive rewards and benefits package including private healthcare, dental and life coverage. Mimecast is an entrepreneurial and high growth company which will provide the right candidate with a wealth of career development opportunities. All Mimecasters strive on being high performers, problem solvers, and team players with passion and integrity.<br><br><br>Mimecast is a global company with certain business operations in North America. By responding to this advertisement you are agreeing to your details, including any personally identifiable information therein, to be transferred to Mimecast North America, Inc. Mimecast North America, Inc will maintain adequate technical and organizational measure to protect your personally identifiable information and shall use it for the purposes of assessing suitability for this role. Should you wish to respond to this advertisement but do not consent to such transfer, please notify us in advance so that we are able to make alternative arrangements.<br><br><br>#LI-RT1<p>PI105800111</p></div></div>"
    },
    {
      "title": "iOS Developer",
      "company": "AWAX Ltd",
      "location": "London",
      "salary": "",
      "summary": "As the iOS Developer, you will…*. Play a key role in building AWAX mobile presence, as well as the development of AWAX as a company....",
      "link": "https://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0AglJ-dploO7XRgbJEguDg-riHeGz3mUWjG98y9lAE2kwl34e9pZEkkKiqyCLTS7WZEkM5i-t-2ahOqFdVg0fsgebcZDZuAjyvtN6AJJrKfZmC0uKYZMrBwbVF6RfkCcihSOb15wyRCaIBTi-2j-YqrQHOjGxg3AVocBI0n-8nVF4iNMBUeoYA2UczElvoRrDUmAVo3vG7YU9Bv8etVdwUPby2XFf4y7LoG_c80tM23MH35UoKpvl10PTyCn6mWAPfqQuW_GFEj4RF2BHkGp7mayPuFNX0jnTyfai8Or2WrYpNJCH5VfzYQmMwDGOmmI475k9y7iVIHhDSM5firXsYH8BsZ5ZiC8oa0EHzQJucsojYkmlxawhcYI8-S4jwjL7indRPU5tJvRG-A_piGe1OAIcZSrQEM_jmxPZ5ivhtbrGt8o3Oqvjt9&vjs=3&p=9&sk=&fvj=1",
      "listing_html": "<div class=\"jobsearch-JobComponent-description icl-u-xs-mt--md\"><div class=\"jobsearch-JobMetadataHeader icl-u-xs-mb--md\"><div class=\"jobsearch-JobMetadataHeader-item  icl-u-xs-mt--xs\">Permanent</div></div><p><b>As the iOS Developer, you will…</b></p><ul><li>Play a key role in building AWAX mobile presence, as well as the development of AWAX as a company.</li><li>Solve intellectually stimulating challenges in an industry poised for disruption.</li><li>You’ll create tech that uses vasts amount of transactional data and applies artificial intelligence engines to improve the financial well being of the users.</li><li>Influence the UX, in a collaborative fashion, for better flow of the app and app architecture.</li><li>Evaluate and improve the processes for constant innovation, which impacts the various teams, including Android, backend, data science and product strategy.</li><li>Benefit from a flat hierarchy and lean development methodologies.</li></ul><p><b>Requirements</b></p><ul><li>Significant experience building iOS applications (Objective-C, SWIFT)</li><li>Who are excellent at problem-solving, able to adapt quickly and take initiative.</li><li>Previous experience with modern mobile app architectures.</li><li>A mindset to solve real-life consumer solutions.</li><li>Passion to create a ‘5-star app’ on the App Store</li><li>An understanding of the benefits of compartmentalizing code through design</li><li>The confidence to challenge our tech and work in teams provide better solutions</li></ul><p>The role is based in our London office, 9am-5pm, five days a week.</p><p>Salary Negotiable</p><p>All Applicants must have the right to work in the UK</p><p>Job Types: Full-time, Permanent</p><p>Experience:</p><ul><li>iOS: 3 years (Preferred)</li></ul></div>"
    }
  ]
}